{"terms":"# Terms and Conditions\n\nThis website is operated and maintained by Jagex Limited, a company registered in England and Wales (registered number 3982706), whose registered office is 11 Sturton Street, Cambridge, CB1 2SN, UK and its suppliers and partners (\"Jagex\"). Jagex and Runescape are registered trademarks of Jagex Limited in the United Kingdom, the United States and other countries.\n\nUse of this website and the services provided via it are conditional upon you accepting the following Terms and Conditions. Unless otherwise specified, your acceptance shall be indicated by your use of this website. If you do not accept these Terms and Conditions, you must not use this website.\n\n## Online games\n\n### Single Player Games\nThese require no registration or subscription to access and play.\n\n### Multiplayer Games\nThese require no subscription, but do require you to choose a Username and a Password to access and play.\n\n### RuneScape\nThere are two versions of RuneScape, a Free Version which requires no subscription but does require you to choose a Username and a Password to access and play, and a Members Version which is Subscription-based. Your use of RuneScape is also subject to our Rules of Conduct.\n\n## Your responsibilities\n\n### Username\nYou must not choose a Username that infringes the rights of any third party, impersonates Jagex staff of other users, or which is deliberately confusing or which is offensive, racist, obscene or otherwise unlawful. We reserve the right to change any Username for any reason.\n\n### Password\nYou agree to keep your Password safe at all times and not to disclose it to any other person. You must ensure that your computer is kept free of viruses and Trojans to ensure the safety of your password. Real Jagex staff will never ask you for your current password.\n\n### Subscription\nSome contents and/or services on this website are subscription-based. If you elect to purchase subscription-based content/services and transmit to us a subscription purchase request, you warrant that all the information that you submit is true and accurate (including without limitation your credit card number and expiration date, and other payment details), and you agree to pay all subscription fees you incur including all applicable taxes.\n\n### RuneScape Account\nYou agree that your RuneScape character and account and items are and remain the property of Jagex. You may not sell, transfer or lend your account to anyone else, or permit anyone else to use your account, and you may not accept an account which anybody else offers you.\n\nYou may create more than one RuneScape account, but if you do, you may not log into more than one account at any time, and they must not interact with each other in any way. Using one account to drop objects for transfer to another of your accounts is not allowed.\n\nWe reserve the right to delete all your accounts, block your access to our website and services, and/or take further legal action if you violate any of these terms and conditions. We may delete or modify any account at any time for any reason.\n\n### Sign-Up\nBy signing-up for an account you are opting-in to allow us to store personal information, cookies, etc. as described in our Privacy Policy.\n\n### Chat facility\nWhen using the chat facility you must not use any language which may be considered by others to be offensive, racist or obscene, or otherwise infringes the rights of third parties. You must not use the chat facility to harass, threaten, scam or deceive other players. You agree that the chat facility is only for role-playing in the game, and is not designed or intended to be used as a forum for other types of discussion. You must not use the chat facility to advertise other websites or products.\n\nYou agree that for the purpose of preventing offensive language and cheating we may automatically or manually censor the chat as we see fit, and that we may record or monitor the chat to help us identify offenders. Sexually harassing, threatening, stalking or otherwise harassing others may result in legal action being taken against you.\n\nIf you are the victim of the sort of behaviour described above, or receive any other unwanted communications you must use the built in facilities to block the messages. If there is a particular user causing a problem then use the ignore function to block further messages (to do this point at the friends menu, click on the 'ignore' tab, click where it says 'click here to add a name' and enter the name of the user to block). If you continue to receive unwanted messages, or receive harassment from multiple players you must use the privacy controls to block all messages from everyone except your friends (to do this point at the configuration menu, and ensure all four privacy settings are switched to 'on'). If you continue to suffer problems, or are not satisfied then you must stop using this web site.\n\n### Cheating\nYou must not exploit any cheats or errors which you find in the Multiplayer Games or RuneScape. Any cheats or errors which you discover must be reported immediately to us.\n\nYou must not attempt to use other programs in conjunction with the Multiplayer Games or RuneScape to give yourself an unfair advantage. You may not use any bots or macros to control your character for you. When you are not playing a Game you must logout. You may not circumvent any of our mechanisms designed to logout inactive users automatically.\n\nYou must not misuse any of our customer service facilities. You must not deliberately enter false information into any of the forms on our website, or in our games. You must not encourage, or attempt to trick other players into breaking our rules.\n\n### Provision of service\nYou must not reverse-engineer, decompile or modify the RuneScape client in any way. You must not use a modified/customised version of the RuneScape client. You must not create or provide any other means by which any of the Games provided by this web site may be played by others (including, without limitation, replacement or modified client/server software, server emulators).\n","about":{"getting-started":"<h2 class=\"rsc-centre-text\">How do I get started?</h2>\nGetting started in RuneScape is an easy and quick process. You can literally be playing within a few minutes.\n\n---\n\n<h3 class=\"rsc-centre-text\">Creating an Account</h3>\n\nFirst of all you must create your account.\n\nThis can be done by clicking the \"play game\" link from the RuneScape main page. This will take you to a screen which gives you the option to play the free game or the member's game.\n\n<img class=\"rsc-image\" src=\"/manual-images/free-game.jpg\" align=\"right\" />\nYou will need to select the free game option for now, but as soon as the registration process is over you may create a members account by going to our [members sign up area](#TODO)\n\n<div style=\"clear:both;\"></div>\n\n---\n\nThis will take you to our world select screen.\n\n<img class=\"rsc-image\" src=\"/manual-images/world-select.jpg\" align=\"right\" />\nAll of the worlds are identical in terms of content, the only difference being the players playing on each one. Select one of the worlds by clicking one of the green links.\n\n<div style=\"clear:both;\"></div>\n\n(Any one will do, although some people find choosing a world with a location nearest to them gives them the best game playing speed)\n\nThe initial download process will then start. During the download a grey security box will pop up. You will be asked 'Do you want to install and run Runescape?' You should check the box that appears next to 'Always trust content from Jagex Ltd' and click OK.\n\n---\n\nWhen the game has loaded you will be presented with a login screen. You will need to choose the option of \"New User\" and then decide on a username and password for your account. You should then tick the box that agrees to our terms of service and click the submit button.\n\n<img class=\"rsc-image\" src=\"/manual-images/design-character.jpg\" align=\"right\" />\n\nYou will then be presented with a character design page\n\nYou should use the right and left arrows to toggle each option until you are happy with your characters look.\n\nYou can change all of the physical appearances of your character as viewed from the screenshot to the right. There is an option in game for you to change your appearance again, though beware it will cost you RuneScape currency for such a privaledge so make sure your character design choices are ones you like!\n\nOnce you have finished you should click the submit button which will launch your character into our tutorial Island!\n\n<div style=\"clear:both;\"></div>\n\n---\n\nTutorial Island is the first place your character will enter in RuneScape. Here you will be introduced to the basics of RuneScape and also participate in some of the skills and trades available. You will be taken through a variety of skills by each instructor which will include casting spells, fishing, mining, combat and much more!\n\n<img class=\"rsc-image\" src=\"/manual-images/tutorial-island.jpg\" align=\"right\" />\nThis should only take about 15 minutes to complete and you will then catch the boat to Lumbridge town where your RuneScape adventure will truly begin!\n\nFrom there you will be able to interact with all of our players, and design your own journey in Runescape!\n\n<div style=\"clear:both;\"></div>\n\n---\n\n<h3 class=\"rsc-centre-text\">Further References</h3>\n(All accessible from main page)\n\n<a class=\"rsc-centre-text\" href=\"/manual\"><h4>RuneScape Manual</h4></a>\nHere you can find information on game controls, skills, quests, rules of conduct and many helpful guides. We suggest you take the time to read this as it contains a wealth of information that will enable you to play RuneScape to its fullest potential.\n\n<a class=\"rsc-centre-text\" href=\"/news\"><h4>News and Updates</h4></a>\nHere you can keep up to date with the development of RuneScape including news on game updates, customer support issues, behind the scenes info, community news and much more.\n\nIt's worth checking this on a regular basis as we update on a weekly basis\n\n[Go to the Rune Scape website to find out more.](/)\n","what-is-a-virtual-world":"<h2 class=\"rsc-centre-text\">What is a virtual world?</h2>\n\nA virtual world is a place where thousands of people from across the globe can interact with each other at the press of a button. Not only will you meet players of all ages and backgrounds, but your actions will have a real impact on shaping the environment and the development of RuneScape.\n\nWhatever the time you log in there will be thousands of online players in our community to interact with. Combine that with over a 1000 different objects to find/trade and a large landscape to explore, you will always have something exciting to attend to.\n\nYou have the absolute freedom and opportunity to create your own virtual life. So why not [get started](/manual/about/getting-started)?\n","what-is-runescape":"<h2 class=\"rsc-centre-text\">What is RuneScape?</h2>\n\nRunescape is a massive multiplayer adventure, with monsters to kill, quests to complete, and treasure to win. You control your own character who will improve and become more powerful the more you play. This isn't a game where everything that happens is pre-determined. What you do in the world is up to you!\n\nRuneScape isn't a game you can just finish in a week, and we are adding in more features and quests on a regular basis to ensure there is always something new for you to try!\n\nSo, read on and most importantly, have fun!\n\nAndrew Gower (Head of Development)\n\n---\n\n<h3 class=\"rsc-centre-text\">Game Features</h3>\n\n<h4 class=\"rsc-centre-text\">Skills</h4>\n\nThere are plenty of skills within RuneScape that you can work at. You could train your character to be an all rounder or you can specialize and perhaps earn a living practicing a craft such as cooking or crafting. The choice is yours and with the large selection of skills available you will definately be spoilt for choice. You can find more information on our skills [here](/manual/skills).\n\n<h4 class=\"rsc-centre-text\">Quests</h4>\n\nMany of the characters in the game can give you quests to go on, each with different rewards. If you are brave you can search for riches in the dungeons or sewers but make sure you are well armed! Try your hand at archery, or learn some magic spells to give yourself an extra advantage. More information on our quests can be found [here](/manual/quests).\n\n<h4 class=\"rsc-centre-text\">Global community</h4>\n\nThe game is multiplayer which means you will meet many other people in the world who you can communicate and trade with. Make new friends and go adventuring together to stand a better chance against the stronger monsters. Perhaps you want to make your money trading valuable goods with others. Or if you like taking risks, you can choose to fight with like-minded people to try and steal their treasure.\n\n(Please see our [safety guide](/manual/guides/safety) so you can be both safe and have fun.)\n\n---\n\n<h3 class=\"rsc-centre-text\">RuneScape Ingredients</h3>\n\n* Over 730,000 map tiles make up the huge world\n* Over 1080 frames of animation for the monsters and players\n* Over 1000 different objects to find and trade\n* Over 22,000 items of scenery with over 950 different designs\n* Over 3200 characters all walking around the map, with over 700 different designs\n"},"controls":{"banks":"<h2 class=\"rsc-centre-text\">The Bank of Varrock</h2>\n\nYou can only hold 30 items at once in RuneScape and carrying around all your money is risky, because when you die you drop what you are holding. Therefore you need to have somewhere to store your extra items and to stash your treasure.\n\nFor this purpose the bank of Varrock has opened branches all over RuneScape. Branches of this bank can be found in Varrock, Falador, Edgeville, and Draynor village. When you wish to access your in-game bank account, just walk to the nearest bank and speak with one of the banker characters inside.\n\n---\n\n<p class=\"rsc-centre-text\"><a href=\"/manual-images/bank.png\"><img src=\"/manual-images/bank.png\" alt=\"Bank interface in game\" /></a></p>\n\nThe bank screen shown above will appear, and you can now choose to deposit and withdraw items. All the items in your account, as well as the items in your inventory will be shown. The bankers aren't fussy and will safely store anything from runes to big piles of coal!\n\nEach item has 2 numbers next to it. The green number indicates the number in your bank account, and the blue number indicates the number that you are holding. Click on an item to select it. You can then use the deposit and withdraw buttons at the bottom of the screen to move it in and out of your bank account.\n\nTo deposit a single item press the button labelled \"One\", to deposit a large stack of items just use the larger numbers. (E.g in the example above pressing the \"100\" button would deposit 100 coins into the bank account.)\n\nThe banks are free to use, so making use of them to safely store your extra items is a very good idea!\n","camera":"<h2 class=\"rsc-centre-text\">Rotating the camera</h2>\n\nThe camera in the game can be rotated by pressing the left and right arrow keys on your keyboard. Regularly rotating the camera to get the best view of the action is a good idea, and is sometimes essential to see objects which you would otherwise miss.\n\nThe camera defaults to running in 'automatic mode'. In this mode the game will attempt to automatically detect if a building is blocking your view, and will rotate the camera to a better angle.\n\nHowever if you want more control you can use the options menu to switch the camera to 'manual mode'. In manual mode you will sometimes find that tall buildings obscure your view. If this happens just press either the left or right arrow key on your keyboard to move the camera around the building.\n\n<div class=\"rsc-row\">\n\n<div class=\"rsc-col rsc-col-50\" style=\"padding:0;\">\n<div class=\"rsc-row\">\n<div class=\"rsc-col rsc-col-36\" style=\"padding:0;\">\n<a href=\"/manual-images/camera-obscured.jpg\"><img class=\"rsc-image\" src=\"/manual-images/camera-obscured.jpg\" /></a>\n</div>\n<div class=\"rsc-col rsc-col-64\">\nHere the building obscures the screen.\n</div>\n</div>\n</div>\n\n<div class=\"rsc-col rsc-col-50\" style=\"padding:0;\">\n<div class=\"rsc-row\">\n<div class=\"rsc-col rsc-col-36\" style=\"padding:0;\">\n<a href=\"/manual-images/camera-clear.jpg\"><img class=\"rsc-image\" src=\"/manual-images/camera-clear.jpg\" /></a>\n</div>\n<div class=\"rsc-col rsc-col-64\">\nRotating the camera solves the problem!\n</div>\n</div>\n</div>\n\n</div>\n","friends":"<h2 class=\"rsc-centre-text\">Using the friends list and ignore list</h2>\n\n<img class=\"rsc-image\" src=\"/manual-images/friends.png\" align=\"right\" />\n The **friends list** allows you to keep in contact with the friends you make in RuneScape. To add a friend to your list click on the button marked \"click here to add a friend\", and enter the name of the person you want to add. You will now be informed whenever your friend logs in or out of runescape. (unless their privacy settings block this - see 'runescape options' below). Players on your list who are currently playing are shown in green, and players who are not currently playing are shown in red. You can also send a private message to a person on your list who is playing. Just click on the players name and when prompted, type in the message you want to send.\n\n<div style=\"clear:both;\"></div>\n\nIf there is a particular player who you do not wish to receive messages from then first click on the button marked \"Ignore\", to access the ignore list. Then click on the button at the bottom marked \"click here to add a name\" and enter the name of the person that you wish to block.\n","inventory":"<h2 class=\"rsc-centre-text\">Using your inventory</h2>\n\n<img class=\"rsc-image\" src=\"/manual-images/inventory.png\" align=\"right\" />\nWhenever you pick-up or purchase an item it will be added to your inventory. To view the items in your inventory, just point your mouse at the backpack icon in the top right corner of the screen. Your inventory has 30 slots available. Large items will take up one inventory slot each. Small items such as money can all be stored in just one slot, in which case a yellow number at the top left of the slot indicates how many of that item you are currently holding.\n\n<div style=\"clear:both;\"></div>\n\nTo use an item you are holding, open your inventory, and then click on the item you wish to use. You can then click on another item or person to use the two together. To drop an item you are holding, select the \"drop\" option, and then click on an empty spot on the ground, and your character will attempt to place it where you indicated.\n\n---\n\n<img class=\"rsc-image\" src=\"/manual-images/inventory-wield.png\" align=\"right\" />\nArmour and weapons are an important aspect of the game. The weaponary you are wielding can often make the difference between winning and losing a battle. To wield a weapon you must first be holding it, then just open your inventory and click on the item that you wish to wear or hold. The background will turn red to indicate that the item is being worn.\n\n<div style=\"clear:both;\"></div>\n","map-view":"<h2 class=\"rsc-centre-text\">Using the map view</h2>\n\n<img class=\"rsc-image\" src=\"/manual-images/map.png\" align=\"right\" />\n\nTo aid your exploration of the world we have also included a map of the surrounding area which will show you what is nearby. To view the map - point your mouse at the 'map icon' at the top-right hand corner of the screen. A map of the surrounding area will appear. Clicking on the map will make your character attempt to walk to the place you have selected. If the route is blocked, for example by a closed door then your character won't move and you will need to go a different way or remove the blockage (e.g by opening/unlocking the door)\n\n<div style=\"clear:both;\"></div>\n\nThe map shows nearby items of interest as coloured dots:\n\n* Objects are shown as red dots.\n* Monsters and game-characters are shown as yellow dots.\n* Fixed locations such as trees & tables as light-blue dots.\n* Other nearby players are shown as white dots.\n","movement":"<h2 class=\"rsc-centre-text\">Moving around the world</h2>\n\n<img class=\"rsc-image\" src=\"/manual-images/walk.png\" align=\"right\" />\nIn order to do anything in the game, you will first need to learn how to get around the world. Fortunately movement is quite simple, and is just a case of pointing the mouse-cursor at the point on the ground where you would like to go, and clicking with the left mouse button.\n\n<div style=\"clear:both;\"></div>\n\nA small yellow cross will briefly appear to indicate that the request was received, then a few moments later your character will start to move. If the yellow cross appears, but your character doesn't start walking immediately, then just wait a few seconds, as it may take a few moments before anything happens. Your character will walk until his/her feet are at the point where you clicked on the ground, and will automatically work out how to walk around any trees or obstacles which may be in the way.\n\n---\n\n<h2 class=\"rsc-centre-text\">Interacting with items and scenery</h2>\n\nTo interact with an item in the world first point your mouse at it. Look at the top left of the screen and you will see a list of things you can do with that item. For instance if you point at an object you will see that you can 'Take' the object. To choose the first option listed, click it with the LEFT mouse button. To choose from one of the other available options click with the RIGHT mouse button, and choose the option you want from the menu which appears. When you request the action a red cross will briefly appear to indicate it was received. You may have to wait a few seconds for your character to perform the requested action.\n\n<img class=\"rsc-image\" src=\"/manual-images/interact.png\" align=\"right\" />\n\nFor instance, in the example on the right, the player is pointing at one of the characters in the game, and in this case is given the default choice of \"Talk-to Lowe\". By LEFT clicking on the character the player could start a conversation and perhaps buy some arrows. By RIGHT clicking, the player could instead access a menu with other available actions.\n\n<div style=\"clear:both;\"></div>\n","options":"<h2 class=\"rsc-centre-text\">RuneScape options</h2>\n\nThe options menu allows you to change the settings on your account, and optionally activate various privacy settings. You should also always use the options menu to logout after playing.\n\n<img class=\"rsc-image\" src=\"/manual-images/options.png\" align=\"right\" />\nThe 1st option allows you to toggle the camera between 'auto' and 'manual' mode. In auto mode the camera will attempt to automatically rotate so that your character is always visible.\n\nThe 2nd option allows you to toggle between using two mouse buttons to control the game, or just one. In single button mode the menu will always appear when you click on more than one item. Some people find this easier, and it's also handy if your mouse only has one button!\n\n<div style=\"clear:both;\"></div>\n\nThe 3rd option allows you to change your password. (See our [security tips](/manual/guides/secure) for important information on keeping your password secure).\n\nThe next 3 options are privacy settings. They are applied to all people who are not on your friends list. You can use these to block chat and/or trade messages from all people who you haven't listed as friends.\n\nThe privacy options can be used to prevent you from being shown as online on other people's friends list when you login. Once activated, only people you have listed as friends will be notifed that you have entered or left RuneScape.\n\nThe final option logs you out of the game. You can't log out whilst fighting, or just after combat, but at all other times you are allowed to leave. When quitting RuneScape you should always use the logout feature, to ensure that your player is saved properly, ready for the next time you play.\n","shops":"<h2 class=\"rsc-centre-text\">RuneScape shops</h2>\nScattered throughout RuneScape there are many shops where you can buy and sell items. Most shops will specialise in a certain type of item. For instance, the sword shop will only buy and sell swords. In addition to the specialist shops there are several \"General stores\" which will buy and sell almost anything. However, items in the general stores normally cost slightly more, and they will pay less for items that you sell to them. If you take the trouble to find the right shop you can often get a better deal.\n\nTo access the shop you must talk to the shop-keeper in the store and choose the conversation option to indicate that you wish to buy or sell. A screen like the one shown on the next page will appear.\n\n<p class=\"rsc-centre-text\"><a href=\"/manual-images/shop.png\"><img src=\"/manual-images/shop.png\" alt=\"Shop screen in game\" /></a></p>\n\nThis window shows all the items you can buy and sell at the current shop. In the example here the player is using a general store which means that there is a variety of different items shown.\n\nNext to each item there are two numbers. The green number indicates the number that the shop has in stock that are available for purchase. The blue number indicates the number that you are holding, which you could sell back to the shop.\n\nClick on an item with the left mouse button. The item will be highlighted, and the purchase and sale prices will be indicated at the bottom of the screen. These two prices will not be the same since the shop buys at a lower price than it sells out (the shopkeeper is making a hefty profit!). You can then choose to buy or sell the item by clicking on the relevant buttons.\n\nThe price of items in the shop also depends on the current stock. If a shop has 500 swords in store it will sell them at a reduced rate to try and clear stock. However, it will also pay less for them if you are selling.\n","stats":"<h2 class=\"rsc-centre-text\">Understanding your players stats</h2>\n\n<img class=\"rsc-image\" src=\"/manual-images/stats.png\" align=\"right\" />\nTo view the stats menu point your mouse at the graph icon and select the stats tab. The stats menu shows your skills and equipment status.\n\nYour skills will increase depending on how you play the game. For instance if you fight a lot of monsters your attack, defense, strength and hits will increase. If you cook food your cooking will increase, cutting down trees increases your woodcutting etc...\n\nTo determine how close you are to advancing a level, point your mouse at the skill you are interested in. The number of experience points you have earnt so far, and the number you need for the next level will be shown at the bottom of the panel.\n\n<div style=\"clear:both;\"></div>\n\nYour **equipment status** indicates the power of the items you are currently wearing/wielding in your inventory. The armour value is the total of all the defensive items you are currently wearing, and modifies your defense in battle. Weapon aim indicates how easy the weapon you are holding is to aim and modifies your attack skills, whereas weapon power shows how much damage the weapon you are holding can do and modifies your strength skill.\n\nYou should try to wear the items which give the largest values in the equipment status section. A fully equipped fighter is able to wear a helmet, body-armour, leg-armour and cape, as well as wielding a weapon and shield.\n","trading":"<h2 class=\"rsc-centre-text\">Trading with other players</h2>\nTrading items with other players is an important aspect of RuneScape and will often allow you to buy and sell your items at a better price than the shops offer. Many rare items cannot be purchased in the shops at all and can only be obtained by finding them yourself, or by purchase from another player.\n\nBefore you start trading you need to find a buyer (or seller). For instance, if you have mined some coal and you want to sell it, you could try standing in a busy area and saying \"Coal for sale!\"\n\nOnce you have found someone to trade with, click on their character with the right mouse button, and select the \"trade-with\" option. The other player will be informed of your request, and to accept your trade they must click on your character and also select the \"trade-with\" option.\n\n---\n\n<p class=\"rsc-centre-text\"><a href=\"/manual-images/trade.png\"><img src=\"/manual-images/trade.png\" alt=\"The first screen of the trade window in game\" /></a></p>\n\nAt this point a screen similar to the one shown above will appear. All the items in your inventory are shown to the right, and the items being traded are shown to the left. To add an item to your offer click on it in the inventory box. If you wish to add multiple items (e.g a stack of coins), then hold down the mouse button over the stack until the desired number has been added. To remove an item from your offer, just click on it in the offer window and it will be removed.\n\nThe items your opponent has offered are shown in the bottom left hand window. Once you are happy with the proposed exchange, press the green \"accept\" button.\n\n---\n\n<p class=\"rsc-centre-text\"><a href=\"/manual-images/trade-confirm.png\"><img src=\"/manual-images/trade-confirm.png\" alt=\"The second screen of the trade window confirmation items + amounts\" /></a></p>\n\nA final confirmation like the one shown above will appear. This clearly lists everything which is being swapped and gives you one last chance to check you are getting the trade you expected. You should read this information carefully, and then once you are sure you are happy with the trade, press the green \"accept\" button.\n\nRemember that there is no way to reverse a trade if you later change your mind. So be careful! Giving items in return for information, or with the promise of getting them back is very risky. Not all RuneScape players are honest, and you could end up losing your items for nothing if you do this.\n"}}
