{"terms":"# Terms and Conditions\n\nThis website is operated and maintained by Jagex Limited, a company registered in England and Wales (registered number 3982706), whose registered office is 11 Sturton Street, Cambridge, CB1 2SN, UK and its suppliers and partners (\"Jagex\"). Jagex and Runescape are registered trademarks of Jagex Limited in the United Kingdom, the United States and other countries.\n\nUse of this website and the services provided via it are conditional upon you accepting the following Terms and Conditions. Unless otherwise specified, your acceptance shall be indicated by your use of this website. If you do not accept these Terms and Conditions, you must not use this website.\n\n## Online games\n\n### Single Player Games\nThese require no registration or subscription to access and play.\n\n### Multiplayer Games\nThese require no subscription, but do require you to choose a Username and a Password to access and play.\n\n### RuneScape\nThere are two versions of RuneScape, a Free Version which requires no subscription but does require you to choose a Username and a Password to access and play, and a Members Version which is Subscription-based. Your use of RuneScape is also subject to our Rules of Conduct.\n\n## Your responsibilities\n\n### Username\nYou must not choose a Username that infringes the rights of any third party, impersonates Jagex staff of other users, or which is deliberately confusing or which is offensive, racist, obscene or otherwise unlawful. We reserve the right to change any Username for any reason.\n\n### Password\nYou agree to keep your Password safe at all times and not to disclose it to any other person. You must ensure that your computer is kept free of viruses and Trojans to ensure the safety of your password. Real Jagex staff will never ask you for your current password.\n\n### Subscription\nSome contents and/or services on this website are subscription-based. If you elect to purchase subscription-based content/services and transmit to us a subscription purchase request, you warrant that all the information that you submit is true and accurate (including without limitation your credit card number and expiration date, and other payment details), and you agree to pay all subscription fees you incur including all applicable taxes.\n\n### RuneScape Account\nYou agree that your RuneScape character and account and items are and remain the property of Jagex. You may not sell, transfer or lend your account to anyone else, or permit anyone else to use your account, and you may not accept an account which anybody else offers you.\n\nYou may create more than one RuneScape account, but if you do, you may not log into more than one account at any time, and they must not interact with each other in any way. Using one account to drop objects for transfer to another of your accounts is not allowed.\n\nWe reserve the right to delete all your accounts, block your access to our website and services, and/or take further legal action if you violate any of these terms and conditions. We may delete or modify any account at any time for any reason.\n\n### Sign-Up\nBy signing-up for an account you are opting-in to allow us to store personal information, cookies, etc. as described in our Privacy Policy.\n\n### Chat facility\nWhen using the chat facility you must not use any language which may be considered by others to be offensive, racist or obscene, or otherwise infringes the rights of third parties. You must not use the chat facility to harass, threaten, scam or deceive other players. You agree that the chat facility is only for role-playing in the game, and is not designed or intended to be used as a forum for other types of discussion. You must not use the chat facility to advertise other websites or products.\n\nYou agree that for the purpose of preventing offensive language and cheating we may automatically or manually censor the chat as we see fit, and that we may record or monitor the chat to help us identify offenders. Sexually harassing, threatening, stalking or otherwise harassing others may result in legal action being taken against you.\n\nIf you are the victim of the sort of behaviour described above, or receive any other unwanted communications you must use the built in facilities to block the messages. If there is a particular user causing a problem then use the ignore function to block further messages (to do this point at the friends menu, click on the 'ignore' tab, click where it says 'click here to add a name' and enter the name of the user to block). If you continue to receive unwanted messages, or receive harassment from multiple players you must use the privacy controls to block all messages from everyone except your friends (to do this point at the configuration menu, and ensure all four privacy settings are switched to 'on'). If you continue to suffer problems, or are not satisfied then you must stop using this web site.\n\n### Cheating\nYou must not exploit any cheats or errors which you find in the Multiplayer Games or RuneScape. Any cheats or errors which you discover must be reported immediately to us.\n\nYou must not attempt to use other programs in conjunction with the Multiplayer Games or RuneScape to give yourself an unfair advantage. You may not use any bots or macros to control your character for you. When you are not playing a Game you must logout. You may not circumvent any of our mechanisms designed to logout inactive users automatically.\n\nYou must not misuse any of our customer service facilities. You must not deliberately enter false information into any of the forms on our website, or in our games. You must not encourage, or attempt to trick other players into breaking our rules.\n\n### Provision of service\nYou must not reverse-engineer, decompile or modify the RuneScape client in any way. You must not use a modified/customised version of the RuneScape client. You must not create or provide any other means by which any of the Games provided by this web site may be played by others (including, without limitation, replacement or modified client/server software, server emulators).\n","about":{"getting-started":"<h2 class=\"rsc-centre-text\">How do I get started?</h2>\nGetting started in RuneScape is an easy and quick process. You can literally be playing within a few minutes.\n\n---\n\n<h3 class=\"rsc-centre-text\">Creating an Account</h3>\n\nFirst of all you must create your account.\n\nThis can be done by clicking the \"play game\" link from the RuneScape main page. This will take you to a screen which gives you the option to play the free game or the member's game.\n\n<img class=\"rsc-image\" src=\"/manual-images/free-game.jpg\" align=\"right\" />\nYou will need to select the free game option for now, but as soon as the registration process is over you may create a members account by going to our [members sign up area](#TODO)\n\n<div style=\"clear:both;\"></div>\n\n---\n\nThis will take you to our world select screen.\n\n<img class=\"rsc-image\" src=\"/manual-images/world-select.jpg\" align=\"right\" />\nAll of the worlds are identical in terms of content, the only difference being the players playing on each one. Select one of the worlds by clicking one of the green links.\n\n<div style=\"clear:both;\"></div>\n\n(Any one will do, although some people find choosing a world with a location nearest to them gives them the best game playing speed)\n\nThe initial download process will then start. During the download a grey security box will pop up. You will be asked 'Do you want to install and run Runescape?' You should check the box that appears next to 'Always trust content from Jagex Ltd' and click OK.\n\n---\n\nWhen the game has loaded you will be presented with a login screen. You will need to choose the option of \"New User\" and then decide on a username and password for your account. You should then tick the box that agrees to our terms of service and click the submit button.\n\n<img class=\"rsc-image\" src=\"/manual-images/design-character.jpg\" align=\"right\" />\n\nYou will then be presented with a character design page\n\nYou should use the right and left arrows to toggle each option until you are happy with your characters look.\n\nYou can change all of the physical appearances of your character as viewed from the screenshot to the right. There is an option in game for you to change your appearance again, though beware it will cost you RuneScape currency for such a privaledge so make sure your character design choices are ones you like!\n\nOnce you have finished you should click the submit button which will launch your character into our tutorial Island!\n\n<div style=\"clear:both;\"></div>\n\n---\n\nTutorial Island is the first place your character will enter in RuneScape. Here you will be introduced to the basics of RuneScape and also participate in some of the skills and trades available. You will be taken through a variety of skills by each instructor which will include casting spells, fishing, mining, combat and much more!\n\n<img class=\"rsc-image\" src=\"/manual-images/tutorial-island.jpg\" align=\"right\" />\nThis should only take about 15 minutes to complete and you will then catch the boat to Lumbridge town where your RuneScape adventure will truly begin!\n\nFrom there you will be able to interact with all of our players, and design your own journey in Runescape!\n\n<div style=\"clear:both;\"></div>\n\n---\n\n<h3 class=\"rsc-centre-text\">Further References</h3>\n(All accessible from main page)\n\n<a class=\"rsc-centre-text\" href=\"/manual\"><h4>RuneScape Manual</h4></a>\nHere you can find information on game controls, skills, quests, rules of conduct and many helpful guides. We suggest you take the time to read this as it contains a wealth of information that will enable you to play RuneScape to its fullest potential.\n\n<a class=\"rsc-centre-text\" href=\"/news\"><h4>News and Updates</h4></a>\nHere you can keep up to date with the development of RuneScape including news on game updates, customer support issues, behind the scenes info, community news and much more.\n\nIt's worth checking this on a regular basis as we update on a weekly basis\n\n[Go to the Rune Scape website to find out more.](/)\n","what-is-a-virtual-world":"<h2 class=\"rsc-centre-text\">What is a virtual world?</h2>\n\nA virtual world is a place where thousands of people from across the globe can interact with each other at the press of a button. Not only will you meet players of all ages and backgrounds, but your actions will have a real impact on shaping the environment and the development of RuneScape.\n\nWhatever the time you log in there will be thousands of online players in our community to interact with. Combine that with over a 1000 different objects to find/trade and a large landscape to explore, you will always have something exciting to attend to.\n\nYou have the absolute freedom and opportunity to create your own virtual life. So why not [get started](/manual/about/getting-started)?\n","what-is-runescape":"<h2 class=\"rsc-centre-text\">What is RuneScape?</h2>\n\nRunescape is a massive multiplayer adventure, with monsters to kill, quests to complete, and treasure to win. You control your own character who will improve and become more powerful the more you play. This isn't a game where everything that happens is pre-determined. What you do in the world is up to you!\n\nRuneScape isn't a game you can just finish in a week, and we are adding in more features and quests on a regular basis to ensure there is always something new for you to try!\n\nSo, read on and most importantly, have fun!\n\nAndrew Gower (Head of Development)\n\n---\n\n<h3 class=\"rsc-centre-text\">Game Features</h3>\n\n<h4 class=\"rsc-centre-text\">Skills</h4>\n\nThere are plenty of skills within RuneScape that you can work at. You could train your character to be an all rounder or you can specialize and perhaps earn a living practicing a craft such as cooking or crafting. The choice is yours and with the large selection of skills available you will definately be spoilt for choice. You can find more information on our skills [here](/manual/skills).\n\n<h4 class=\"rsc-centre-text\">Quests</h4>\n\nMany of the characters in the game can give you quests to go on, each with different rewards. If you are brave you can search for riches in the dungeons or sewers but make sure you are well armed! Try your hand at archery, or learn some magic spells to give yourself an extra advantage. More information on our quests can be found [here](/manual/quests).\n\n<h4 class=\"rsc-centre-text\">Global community</h4>\n\nThe game is multiplayer which means you will meet many other people in the world who you can communicate and trade with. Make new friends and go adventuring together to stand a better chance against the stronger monsters. Perhaps you want to make your money trading valuable goods with others. Or if you like taking risks, you can choose to fight with like-minded people to try and steal their treasure.\n\n(Please see our [safety guide](/manual/guides/safety) so you can be both safe and have fun.)\n\n---\n\n<h3 class=\"rsc-centre-text\">RuneScape Ingredients</h3>\n\n* Over 730,000 map tiles make up the huge world\n* Over 1080 frames of animation for the monsters and players\n* Over 1000 different objects to find and trade\n* Over 22,000 items of scenery with over 950 different designs\n* Over 3200 characters all walking around the map, with over 700 different designs\n"},"controls":{"banks":"<h2 class=\"rsc-centre-text\">The Bank of Varrock</h2>\n\nYou can only hold 30 items at once in RuneScape and carrying around all your money is risky, because when you die you drop what you are holding. Therefore you need to have somewhere to store your extra items and to stash your treasure.\n\nFor this purpose the bank of Varrock has opened branches all over RuneScape. Branches of this bank can be found in Varrock, Falador, Edgeville, and Draynor village. When you wish to access your in-game bank account, just walk to the nearest bank and speak with one of the banker characters inside.\n\n---\n\n<p class=\"rsc-centre-text\"><a href=\"/manual-images/bank.png\"><img src=\"/manual-images/bank.png\" alt=\"Bank interface in game\" /></a></p>\n\nThe bank screen shown above will appear, and you can now choose to deposit and withdraw items. All the items in your account, as well as the items in your inventory will be shown. The bankers aren't fussy and will safely store anything from runes to big piles of coal!\n\nEach item has 2 numbers next to it. The green number indicates the number in your bank account, and the blue number indicates the number that you are holding. Click on an item to select it. You can then use the deposit and withdraw buttons at the bottom of the screen to move it in and out of your bank account.\n\nTo deposit a single item press the button labelled \"One\", to deposit a large stack of items just use the larger numbers. (E.g in the example above pressing the \"100\" button would deposit 100 coins into the bank account.)\n\nThe banks are free to use, so making use of them to safely store your extra items is a very good idea!\n","camera":"<h2 class=\"rsc-centre-text\">Rotating the camera</h2>\n\nThe camera in the game can be rotated by pressing the left and right arrow keys on your keyboard. Regularly rotating the camera to get the best view of the action is a good idea, and is sometimes essential to see objects which you would otherwise miss.\n\nThe camera defaults to running in 'automatic mode'. In this mode the game will attempt to automatically detect if a building is blocking your view, and will rotate the camera to a better angle.\n\nHowever if you want more control you can use the options menu to switch the camera to 'manual mode'. In manual mode you will sometimes find that tall buildings obscure your view. If this happens just press either the left or right arrow key on your keyboard to move the camera around the building.\n\n<div class=\"rsc-row\">\n\n<div class=\"rsc-col rsc-col-50\" style=\"padding:0;\">\n<div class=\"rsc-row\">\n<div class=\"rsc-col rsc-col-36\" style=\"padding:0;\">\n<a href=\"/manual-images/camera-obscured.jpg\"><img class=\"rsc-image\" src=\"/manual-images/camera-obscured.jpg\" /></a>\n</div>\n<div class=\"rsc-col rsc-col-64\">\nHere the building obscures the screen.\n</div>\n</div>\n</div>\n\n<div class=\"rsc-col rsc-col-50\" style=\"padding:0;\">\n<div class=\"rsc-row\">\n<div class=\"rsc-col rsc-col-36\" style=\"padding:0;\">\n<a href=\"/manual-images/camera-clear.jpg\"><img class=\"rsc-image\" src=\"/manual-images/camera-clear.jpg\" /></a>\n</div>\n<div class=\"rsc-col rsc-col-64\">\nRotating the camera solves the problem!\n</div>\n</div>\n</div>\n\n</div>\n","friends":"<h2 class=\"rsc-centre-text\">Using the friends list and ignore list</h2>\n\n<img class=\"rsc-image\" src=\"/manual-images/friends.png\" align=\"right\" />\n The **friends list** allows you to keep in contact with the friends you make in RuneScape. To add a friend to your list click on the button marked \"click here to add a friend\", and enter the name of the person you want to add. You will now be informed whenever your friend logs in or out of runescape. (unless their privacy settings block this - see 'runescape options' below). Players on your list who are currently playing are shown in green, and players who are not currently playing are shown in red. You can also send a private message to a person on your list who is playing. Just click on the players name and when prompted, type in the message you want to send.\n\n<div style=\"clear:both;\"></div>\n\nIf there is a particular player who you do not wish to receive messages from then first click on the button marked \"Ignore\", to access the ignore list. Then click on the button at the bottom marked \"click here to add a name\" and enter the name of the person that you wish to block.\n","inventory":"<h2 class=\"rsc-centre-text\">Using your inventory</h2>\n\n<img class=\"rsc-image\" src=\"/manual-images/inventory.png\" align=\"right\" />\nWhenever you pick-up or purchase an item it will be added to your inventory. To view the items in your inventory, just point your mouse at the backpack icon in the top right corner of the screen. Your inventory has 30 slots available. Large items will take up one inventory slot each. Small items such as money can all be stored in just one slot, in which case a yellow number at the top left of the slot indicates how many of that item you are currently holding.\n\n<div style=\"clear:both;\"></div>\n\nTo use an item you are holding, open your inventory, and then click on the item you wish to use. You can then click on another item or person to use the two together. To drop an item you are holding, select the \"drop\" option, and then click on an empty spot on the ground, and your character will attempt to place it where you indicated.\n\n---\n\n<img class=\"rsc-image\" src=\"/manual-images/inventory-wield.png\" align=\"right\" />\nArmour and weapons are an important aspect of the game. The weaponary you are wielding can often make the difference between winning and losing a battle. To wield a weapon you must first be holding it, then just open your inventory and click on the item that you wish to wear or hold. The background will turn red to indicate that the item is being worn.\n\n<div style=\"clear:both;\"></div>\n","map-view":"<h2 class=\"rsc-centre-text\">Using the map view</h2>\n\n<a href=\"/manual-images/map.png\"><img class=\"rsc-image\" src=\"/manual-images/map.png\" align=\"right\" /></a>\n\nTo aid your exploration of the world we have also included a map of the surrounding area which will show you what is nearby. To view the map - point your mouse at the 'map icon' at the top-right hand corner of the screen. A map of the surrounding area will appear. Clicking on the map will make your character attempt to walk to the place you have selected. If the route is blocked, for example by a closed door then your character won't move and you will need to go a different way or remove the blockage (e.g by opening/unlocking the door)\n\n<div style=\"clear:both;\"></div>\n\nThe map shows nearby items of interest as coloured dots:\n\n* Objects are shown as red dots.\n* Monsters and game-characters are shown as yellow dots.\n* Fixed locations such as trees & tables as light-blue dots.\n* Other nearby players are shown as white dots.\n","movement":"<h2 class=\"rsc-centre-text\">Moving around the world</h2>\n\n<img class=\"rsc-image\" src=\"/manual-images/walk.png\" align=\"right\" />\nIn order to do anything in the game, you will first need to learn how to get around the world. Fortunately movement is quite simple, and is just a case of pointing the mouse-cursor at the point on the ground where you would like to go, and clicking with the left mouse button.\n\n<div style=\"clear:both;\"></div>\n\nA small yellow cross will briefly appear to indicate that the request was received, then a few moments later your character will start to move. If the yellow cross appears, but your character doesn't start walking immediately, then just wait a few seconds, as it may take a few moments before anything happens. Your character will walk until his/her feet are at the point where you clicked on the ground, and will automatically work out how to walk around any trees or obstacles which may be in the way.\n\n---\n\n<h2 class=\"rsc-centre-text\">Interacting with items and scenery</h2>\n\nTo interact with an item in the world first point your mouse at it. Look at the top left of the screen and you will see a list of things you can do with that item. For instance if you point at an object you will see that you can 'Take' the object. To choose the first option listed, click it with the LEFT mouse button. To choose from one of the other available options click with the RIGHT mouse button, and choose the option you want from the menu which appears. When you request the action a red cross will briefly appear to indicate it was received. You may have to wait a few seconds for your character to perform the requested action.\n\n<img class=\"rsc-image\" src=\"/manual-images/interact.png\" align=\"right\" />\n\nFor instance, in the example on the right, the player is pointing at one of the characters in the game, and in this case is given the default choice of \"Talk-to Lowe\". By LEFT clicking on the character the player could start a conversation and perhaps buy some arrows. By RIGHT clicking, the player could instead access a menu with other available actions.\n\n<div style=\"clear:both;\"></div>\n","options":"<h2 class=\"rsc-centre-text\">RuneScape options</h2>\n\nThe options menu allows you to change the settings on your account, and optionally activate various privacy settings. You should also always use the options menu to logout after playing.\n\n<img class=\"rsc-image\" src=\"/manual-images/options.png\" align=\"right\" />\nThe 1st option allows you to toggle the camera between 'auto' and 'manual' mode. In auto mode the camera will attempt to automatically rotate so that your character is always visible.\n\nThe 2nd option allows you to toggle between using two mouse buttons to control the game, or just one. In single button mode the menu will always appear when you click on more than one item. Some people find this easier, and it's also handy if your mouse only has one button!\n\n<div style=\"clear:both;\"></div>\n\nThe 3rd option allows you to change your password. (See our [security tips](/manual/guides/secure) for important information on keeping your password secure).\n\nThe next 3 options are privacy settings. They are applied to all people who are not on your friends list. You can use these to block chat and/or trade messages from all people who you haven't listed as friends.\n\nThe privacy options can be used to prevent you from being shown as online on other people's friends list when you login. Once activated, only people you have listed as friends will be notifed that you have entered or left RuneScape.\n\nThe final option logs you out of the game. You can't log out whilst fighting, or just after combat, but at all other times you are allowed to leave. When quitting RuneScape you should always use the logout feature, to ensure that your player is saved properly, ready for the next time you play.\n","shops":"<h2 class=\"rsc-centre-text\">RuneScape shops</h2>\nScattered throughout RuneScape there are many shops where you can buy and sell items. Most shops will specialise in a certain type of item. For instance, the sword shop will only buy and sell swords. In addition to the specialist shops there are several \"General stores\" which will buy and sell almost anything. However, items in the general stores normally cost slightly more, and they will pay less for items that you sell to them. If you take the trouble to find the right shop you can often get a better deal.\n\nTo access the shop you must talk to the shop-keeper in the store and choose the conversation option to indicate that you wish to buy or sell. A screen like the one shown on the next page will appear.\n\n<p class=\"rsc-centre-text\"><a href=\"/manual-images/shop.png\"><img src=\"/manual-images/shop.png\" alt=\"Shop screen in game\" /></a></p>\n\nThis window shows all the items you can buy and sell at the current shop. In the example here the player is using a general store which means that there is a variety of different items shown.\n\nNext to each item there are two numbers. The green number indicates the number that the shop has in stock that are available for purchase. The blue number indicates the number that you are holding, which you could sell back to the shop.\n\nClick on an item with the left mouse button. The item will be highlighted, and the purchase and sale prices will be indicated at the bottom of the screen. These two prices will not be the same since the shop buys at a lower price than it sells out (the shopkeeper is making a hefty profit!). You can then choose to buy or sell the item by clicking on the relevant buttons.\n\nThe price of items in the shop also depends on the current stock. If a shop has 500 swords in store it will sell them at a reduced rate to try and clear stock. However, it will also pay less for them if you are selling.\n","stats":"<h2 class=\"rsc-centre-text\">Understanding your players stats</h2>\n\n<img class=\"rsc-image\" src=\"/manual-images/stats.png\" align=\"right\" />\nTo view the stats menu point your mouse at the graph icon and select the stats tab. The stats menu shows your skills and equipment status.\n\nYour skills will increase depending on how you play the game. For instance if you fight a lot of monsters your attack, defense, strength and hits will increase. If you cook food your cooking will increase, cutting down trees increases your woodcutting etc...\n\nTo determine how close you are to advancing a level, point your mouse at the skill you are interested in. The number of experience points you have earnt so far, and the number you need for the next level will be shown at the bottom of the panel.\n\n<div style=\"clear:both;\"></div>\n\nYour **equipment status** indicates the power of the items you are currently wearing/wielding in your inventory. The armour value is the total of all the defensive items you are currently wearing, and modifies your defense in battle. Weapon aim indicates how easy the weapon you are holding is to aim and modifies your attack skills, whereas weapon power shows how much damage the weapon you are holding can do and modifies your strength skill.\n\nYou should try to wear the items which give the largest values in the equipment status section. A fully equipped fighter is able to wear a helmet, body-armour, leg-armour and cape, as well as wielding a weapon and shield.\n","trading":"<h2 class=\"rsc-centre-text\">Trading with other players</h2>\nTrading items with other players is an important aspect of RuneScape and will often allow you to buy and sell your items at a better price than the shops offer. Many rare items cannot be purchased in the shops at all and can only be obtained by finding them yourself, or by purchase from another player.\n\nBefore you start trading you need to find a buyer (or seller). For instance, if you have mined some coal and you want to sell it, you could try standing in a busy area and saying \"Coal for sale!\"\n\nOnce you have found someone to trade with, click on their character with the right mouse button, and select the \"trade-with\" option. The other player will be informed of your request, and to accept your trade they must click on your character and also select the \"trade-with\" option.\n\n---\n\n<p class=\"rsc-centre-text\"><a href=\"/manual-images/trade.png\"><img src=\"/manual-images/trade.png\" alt=\"The first screen of the trade window in game\" /></a></p>\n\nAt this point a screen similar to the one shown above will appear. All the items in your inventory are shown to the right, and the items being traded are shown to the left. To add an item to your offer click on it in the inventory box. If you wish to add multiple items (e.g a stack of coins), then hold down the mouse button over the stack until the desired number has been added. To remove an item from your offer, just click on it in the offer window and it will be removed.\n\nThe items your opponent has offered are shown in the bottom left hand window. Once you are happy with the proposed exchange, press the green \"accept\" button.\n\n---\n\n<p class=\"rsc-centre-text\"><a href=\"/manual-images/trade-confirm.png\"><img src=\"/manual-images/trade-confirm.png\" alt=\"The second screen of the trade window confirmation items + amounts\" /></a></p>\n\nA final confirmation like the one shown above will appear. This clearly lists everything which is being swapped and gives you one last chance to check you are getting the trade you expected. You should read this information carefully, and then once you are sure you are happy with the trade, press the green \"accept\" button.\n\nRemember that there is no way to reverse a trade if you later change your mind. So be careful! Giving items in return for information, or with the promise of getting them back is very risky. Not all RuneScape players are honest, and you could end up losing your items for nothing if you do this.\n"},"guides":{"avoid-scamming":"<h2 class=\"rsc-centre-text rsc-caution-text\">Scamming Prevention Guide</h2>\n\nWhilst Runescape for the most part is a friendly community with honest players, just as in real life there will be untrustworthy and dishonest people who will look to gain an unfair advantage in the game by trying to scam you of your items/account.\n\nOur policy is to never return lost items to players that have been scammed, since doing so just encourages users to claim they lost items they never had to gain an unfair advantage. We also provide a totally safe way to trade items in the game.\n\nWe therefore suggest that you read the following information to ensure that you do not fall victim to a scammer.\n\n<h3 class=\"rsc-centre-text rsc-caution-text\">Scamming prevention FAQ</h3>\n\n#### What is a scam?\n\nA scam is the act of acquiring item(s) from another player through misinformation, confusion and pressure, or by taking advantage of basic trust.\n\n#### What do I do if I get scammed?\n\nUnfortunately, if you do fall victim to a scam we cannot return any of the lost items back to your player. However, you can report the scammer at the time of the event by using the in game report button which is situated to the bottom right of the client window. For more information see our [Reporting abuse guide](/manual/guides/reporting-abuse) located within the guides section in our online manual.\n\n#### How do I prevent myself from being scammed?\n\nWe have put together some useful tips for you that should help prevent you from being scammed by another player. These can be found on the next few pages.\n\n<h3 class=\"rsc-centre-text rsc-caution-text\">Tips to avoid being scammed</h3>\n\n#### Think carefully about the trustworthiness of the other player\n\nBefore commencing in a trade/transaction with another player always consider the trustworthiness of their character.\n\n#### Be wary of newly created/low level players\n\nA player's level is one indicator that may be used to measure their trustworthiness. For example if a level 3 (lowest level) player is offering you rare or expensive items you should ask yourself exactly how such a low player could have acquired these items? There are some people that will register a new character purely to scam other players. Higher players are generally more trustworthy as if they do scam and you report them they have more to lose than a newly created character. These examples are not ALWAYS the case, and it does not mean ALL high level characters are trustworthy, but generally it holds true.\n\nYou can see a players level by rightclicking on their player, or by going to the high scores table from the main page.\n\n#### Ask around\n\nIf you are unsure of a player's credibility, it is definitely worth asking around in game to see if you can find out anything on the player. You might be able to find someone who has had a trading experience with this player.\n\n#### Do they want to trade officially?\n\nIf another player suggests an unofficial type of trade, you should definitely be suspicious. We have a very secure trading system for players and there is absolutely no reason why someone should not want to use this. Some examples of this are people asking for you to give them items first before they are willing to give you their part of the deal. Another example is someone asking you to drop the items on the floor instead of using the trade window.\n\nIn 99% of these cases the other player will be looking to scam your items. Suggest to them that you use the secure trading system and if they decline then refuse to go any further in the trade. For more information on our trading system please refer to the [trading guide](/manual/controls/trading), located in the online manual.\n\n#### Displays of trust\n\nSome players will ask you to display an element of trust in order to receive a free item or to join a group. This normally comes in the form of giving them an item, and them giving you it back. This will start as a small item and escalate to larger items or even multiple items.\n\nDo not engage in any type of trust test as it will almost certainly result in you losing valuable items. A good rule to go by is do not give any other player an item you are not yourself willing to lose.\n\n#### Is the deal too good to be true?\n\nIf you are being offered an exceptionally good deal and there are certain things that are making you suspicious then do NOT go ahead with the deal. If something seems too good to be true, in most cases it normally is.\n\n#### Be extra careful and vigilant\n\nWhen conducting a trade with another player try to be extra careful and vigilant. You should be aware that people can remove and add items freely up until the final confirmation screen. ALWAYS check the final confirmation screen to ensure not only you are giving the items you mean to give but that you are receiving what you expect also.\n\n#### Players offering to make you items\n\nCertain objects in RuneScape have minimum level requirements in order to craft the item. If somebody offers to make an item for you, its good practice to not only be aware of the level of skill needed to craft that item but to check on the high scores table to ensure the player really does have the skill level to make that item.\n\nThen if you are happy with their levels it's a good idea to ask for something in return of the same value of the items you are giving them to craft to cover yourself should they be looking to steal the items. Any player that is genuinely looking to craft these items for you should not have a problem with this method. If they do, then most likely they are trying to scam you.\n\n#### Large trades\n\nIf you are conducting a very large trade and it is too large to conduct in one transaction, it is suggested that you break it into smaller, equal proportions. In order to cover yourself it is best that for each of these smaller trades you only trade items in which you receive items from the other player of the same value.\n\n<h3 class=\"rsc-centre-text rsc-caution-text\">Tips to avoid having your account stolen</h3>\n\n#### Trojan/Key loggers\n\nThis is probably the most common way players have their accounts stolen. Trojan/key loggers normally come in the form of an executable file, but can take different forms and are normally cleverly renamed to try and hide the .exe extension. Often they are passed off as possible applications that claim to be related to Runescape (Runescape cartoons, calculators etc). They can be distributed as part of an email attachment, a download from a website or even an instant messenger file send.\n\n#### Scam sites\n\nThese are sites that claim to offer advantages to players and will ask for your character name and password to pass them on to you. These are normally things like item/stat upgrades, free items, beta testing, moderator applications etc.\n\nWe do not offer any of these services and anything claiming to is **ALWAYS** a scam. You should **NEVER** be entering your password into a website that is not www.runescape.com\n\n#### Fake emails\n\nAny emails we send out will only ever contain purely text information and never an attachment. We will never ask you to download anything in an email and will never ask for you to reply with your password. If we do send you an email and request more information from you it will always ask you to send in a query via our customer support section.\n\n#### Staff impersonation\n\nIt is true that Jagex staff, do have moderator characters, but all customer support issues are dealt with officially through our customer support area on the Runescape website.\n\nStaff will **NEVER** ask for your details in game and never request that you give items to them. If someone does approach you claiming to be Jagex staff and asks for information that makes you suspicious, then it is certainly someone impersonating our staff. These characters should be reported using the in game report system.\n\n#### Downloading 3rd party software\n\nPrograms that claim to give you an advantage in Runescape will either be one of two things:\n\n1. A macro program that will control your character for you whilst away from your computer. Our systems detect these and we permanently ban any accounts we find using them.\n2. A keylogger or a Trojan virus.\n\nEither way, your account and any information you have on your computer will be at risk and we suggest you NEVER download these types of programs for your own safety.\n\nFor more detailed information on keeping your account secure we have an in depth [security tips guide](/manual/guides/security-tips) that will be of use. This can be found in the guides section, which is located in our online manual.\n","health-safety":"<h2 class=\"rsc-centre-text\">WARNING: READ BEFORE PLAYING</h2>\n<h3 class=\"rsc-centre-text\">Photo sensitive Seizure warning</h3>\nA very small proportion of people can experience epileptic seizures when exposed to certain light patterns or flashing lights. Such exposure to certain patterns or backgrounds on a computer screen, or while playing video games, may induce an epileptic seizure in these people. Certain conditions can induce previously undetected epileptic symptoms even in people who have no prior history of prior seizures or epilepsy.\n\nIf you, or anyone in your family, have an epileptic condition, consult your physician prior to playing RuneScape. If you experience any of the following symptoms while playing a video or computer game - dizziness, eye or muscle twitches, altered vision, loss of awareness, disorientation, any involuntary movement, or convulsions - STOP PLAYING IMMEDIATELY and consult your physician. Only when they have given you the all clear should you resume play.\n\n<h3 class=\"rsc-centre-text\">Repetitive Strain Injury Warning</h3>\nProlonged use of a computer, bad posture, low levels of fitness can all combine to contribute to a condition referred to as Repetitive Strain Injury.\n\nTo help avoid it follow these simple steps:\n\nWhen playing RuneScape take a 10 minute break from your computer every hour. Get up and walk around, do some stretches. Exercise regularly. When using the computer only maintain a loose grip on the mouse. Never rest your wrists on a support whilst typing or using the mouse. For extended periods of mouse-only use place the mouse directly in front of you between you and the monitor. Make sure the top of the monitor is at eye level and directly in front of you and that your seat is at the right height so that your forearms are at right angles to your upper arms.\n\nThe picture below illustrates a correct sitting position:\n\n<p class=\"rsc-centre-text\"><a href=\"/manual-images/posture.jpg\"><img src=\"/manual-images/posture.jpg\" alt=\"Correct sitting posture\" /></a></p>\n\nIf you have any serious pain or discomfort in your arms, neck, shoulders or back whilst playing RuneScape stop playing immediately and consult your physician. Only when they have given you the all clear should you resume play.\n","play-safely":"RuneScape is a multiplayer adventure so let's face it, you are going to meet lots of new and exciting friends along your travels.\n\nHowever please remember you DO NOT know any of these people in real life. This is not to say that they are not as nice in real life as they act in RuneScape, they most likely are, but it's important and best to keep a safe distance from your RuneScape fellow players.\n\nFor this reason we have put together some helpful hints so you can be both safe and have fun on RuneScape.\n\n1. Do NOT tell other players personal information. Not even if they claim to be Jagex staff!\n\n    Don't tell ANYONE your real name, email address, home address, messenger handle or phone number. Use your RuneScape in game friends list and chat to interact with the other players safely.\n\n2. If you feel that someone is making you uncomfortable you should not attempt to carry on a conversation with this person.\n\n    Please see our disruptive members guide for details on both how to ignore these players and report them should they directly insult you.\n\n3. Chatting of a sexual nature (aka cybering) is strictly forbidden in RuneScape and should someone approach you in game with this type of chat, please follow the instructions in our disruptive members guide and report the player to us.\n\n4. RuneScape is an ONLINE game. There is no need to meet anyone in real life. Remember you only have the other player's word that they are who they say they are. This includes their gender, age, occupation and everything they claim to be.\n\n    If you decide against this and do plan to meet a RuneScape player in real life, please tell your parents or guardian what you are doing and have them assist you on the meet. DO NOT go alone.\n\n5. Always keep your parents or guardians informed of how your game is going. It would be a good idea to introduce them to the game and encourage them to check on you regularly to ensure that your game remains problem free.\n\n6. If you need any help we are only an email form away. Please contact customer support and we will get back to you ASAP. Have fun and be safe. That's what RuneScape is all about!\n\n7. For serious cases related to Child Protection in the United States, please report it to: http://www.fbi.gov/contactus.htm\n\n    For serious cases in the UK contact your local police force via their Station number, find more information here: http://www.police.uk, alternatively contact the Social Services (you can find their number in the phone book).\n\nOr if you are outside the United Kingdom or the United States we suggest you contact your local law enforcement agency.\n\nFor further information on chatting safely online please see the following sites:\n\n* www.iwf.org.uk\n* www.chatdanger.com\n* www.nch.org.uk/internet\n* www.getnetwise.org\n* www.thinkuknow.co.uk\n* www.fkbko.net\n* www.childnet-int.org\n","reporting-abuse":"<h2 class=\"rsc-centre-text\">How to handle abusive players</h2>\n\nIf whilst you are playing RuneScape, you happen to come across another player that is either harassing yourself or other players, or is generally being disruptive, there are various things you may do.\n\n<h3 class=\"rsc-centre-text\">In game system</h3>\n\n<a href=\"/manual-images/report-abuse-screenshot.jpg\"><img src=\"/manual-images/report-abuse-screenshot.jpg\" alt=\"The 'report abuse' button in game\" align=\"right\" /></a>\n\nFirstly you may report the player in game via the red \"report abuse\" button situated to the bottom right of the game client just to the right of the private messages tab.\n\n<div style=\"clear:both;\"></div>\n\nThe best circumstances to report a player in game are the following:\n\n* Swearing, profanity or racial abuse (see guidance on how to use the Report Abuse System below)\n* Trade scams (lied about the trade to steal items from you)\n* Asking other players for passwords (trying to steal accounts)\n* Attempting to buy or sell a RuneScape account\n* Impersonating our staff\n* Advertising a scam website\n\nThis will enable us with your help to take quick and effective action against the abusive players in Runescape.\n\n<h4>Please Note: (reference trade scams)</h4>\nWe must remind you though that if you do lend anyone anything it is at your OWN RISK! Many people are conned by others and whilst we are trying to catch them, the problem will be minimized if you only engage in swaps and trusts if you are FULLY 100 percent convinced that they are trustworthy.\n\nPlease also note that we cannot replace any money or items that have been lost.\n\n<h4>Punishments</h4>\nOur punishments range from a verbal warning, to black marks being accrued against your account. This will lead very quickly to temporary and permanent bans should you re-offend. The severity of punishment will depend on the severity of each report and the number of total reports against a player.\n\n<h4>Caution - How to use the Report Abuse System</h4>\nIf you are going to send in a report against a player you must make sure that it is a legitimate claim of abuse. This means that it must contain evidence of the above situations or we will not be able to take any action.\n\nBefore sending in a verbal abuse report please try and think about whether you are genuinely offended by the other players remarks. If the chat filter has blocked out the profanity then there is no need to send in a report. Please only do so if you are genuinely offended.\n\nSending in hoax reports slows us down with dealing with your other queries, and repeatedly doing so is likely to result in action being taken against your account.\n\nFor example petty abuse such as simply calling someone a \"noob\" is not a good enough reason to report someone for abuse. Being offensive to someone else and then reporting them when they retaliate is also a complete misuse of the system. Our logs clearly show the incident that is reported, so it will be easy see who actually started the abuse.\n\nSo please, take some time and use some common sense to ensure that your report is valid.\n\n<h3 class=\"rsc-centre-text\">Online Customer Support forms</h3>\nThere are certain circumstances when it is better to report players through our online report forms which can be found [here](/support).\n\nThese situations might include\n\n* players using macromeres or cheating programs\n* hack sites that perhaps you might have stumbled across\n* Any other valid abuse that you do not feel can be reported in game\n\n<h3 class=\"rsc-centre-text\">Further helpful hints on abusive players</h3>\nIf you come across a player in game that is harassing you and you wish to ignore the player, you can do so by reading the following:\n\nIf there is a particular user causing a problem then use the ignore function to block further messages. (To do this point at the friends menu, click on the 'ignore' tab, click where it says 'click here to add a name' and finally enter the name of the user to block.)\n\nIf you continue to receive unwanted messages, or receive harassment from multiple players then you should use the privacy controls to block all messages from everyone except your friends. (To do this point at the configuration menu, and ensure all 4 privacy settings are switched to 'on').\n","responsible-gaming":"Jagex intends for everyone to use and enjoy RuneScape in a responsible way.\n\nRuneScape is a computer entertainment product and is operated with the intention of providing our users with an immersive, challenging and entertaining experience which they can enjoy from home, work or college via an online device.\n\nWhilst we do not block people from being logged in to RuneScape over a certain number of hours we do not want or encourage people to play for more hours than is reasonable.\n\nPlease follow these simple guidelines to maintain a balanced life and get the most out of playing RuneScape.\n\n1. Take a break from the computer, read a book, watch a movie\n2. Take exercise at least once a week\n3. Remember it is just a game\n4. When eating, take break from the computer - it'll still be there when you come back\n5. Don't ignore your real life friends, meet up with them on a regular basis\n6. Work, or study matters, don't let playing a game stop you doing well in your studies or at work.\n\nIf you feel that your use of RuneScape is out of control and you are finding it difficult following some or all of the steps mentioned above, then please seek advice and help from a responsible adult, or medical professional.\n","security-tips":"<h2 class=\"rsc-centre-text rsc-caution-text\">1. Do NOT tell other players personal information</h2>\n\nNot even if they claim to be Jagex staff! The RuneScape chat is not encrypted and therefore must not EVER be used to send sensitive information.\n\n* Don't tell ANYONE your password ever!\n* Don't tell others your password recovery-questions\n* Don't tell others your real name, email, ICQ number, credit-card details, etc...\n\n<h2 class=\"rsc-centre-text rsc-caution-text\">2. Think before using your password</h2>\n\nNever enter your password or recovery-questions into ANY website other than runescape.com or runescape.co.uk.\n\nYou should NOT use the same password at every website you visit, this is very dangerous! Your RuneScape password should be different to all your other passwords, and ONLY used for RuneScape.\n\nWhen entering your password make sure nobody is standing behind you watching you type it in! You wouldn't believe how often this happens! Please be careful.\n\n<h2 class=\"rsc-centre-text rsc-caution-text\">3. Watch out for fake websites!</h2>\n\nThere are websites which look very similar to runescape.com but <span style=\"color:red;\">STEAL</span> your password. Don't trust a site just because it looks official.\n\n* RuneScape cheat sites - There are NO RuneScape cheats. These are fakes!\n* RuneScape staff sites - We do not have secret sites on which you can become an admin or moderator! These are fakes!\n* RuneScape surveys - Our official surveys NEVER require a password\n* RuneScape chat boards/rooms - Don't use your RuneScape password on these sites! Use a DIFFERENT password or you will regret it!\n* RuneScape test servers - Watch out for fake servers. If in doubt create a NEW account, rather than risking your main character.\n\n<h2 class=\"rsc-centre-text rsc-caution-text\">4. Don't use unofficial RuneScape addons.</h2>\n\nThere are programs which claim to make RuneScape easier or better, but actually <span style=\"color:red;\">STEAL</span> your password. Not only is using these programs extremely risky, it's also against the rules.\n\n\n<h2 class=\"rsc-centre-text rsc-caution-text\">5. Watch out for fake emails, and fake staff!</h2>\n\nThere are many people pretending to be Jagex Staff or impersonating its creators. It is easy to forge emails, so don't trust an email just because it looks official. **Real staff will NEVER ask you for your password!**\n\nTo help you be sure that correspondance from us is genuine, we send all messages to your RuneScape **Message Centre**. This is accessible from the RuneScape front page, and will require your RuneScape in-game login details (again, please be sure that you are at RuneScape.com).\n\nWe **never** send emails to players.\n\n* We **never** send emails saying we need your password to check you aren't cheating!\n* We **never** send emails saying we need your recovery-questions to check you didn't steal the account.\n* We **never** send emails containing attachments of any sort\n* We **never** send emails saying we need your password to let you join the Jagex staff.\n* We **never** send emails offering to let you test new features or servers. These are fakes!\n\n\n<h2 class=\"rsc-centre-text rsc-caution-text\">6. Do NOT share your RuneScape account with anyone else!</h2>\n\nNot even your best friend! A HUGE number of players have lost their account this way. Not only is this an extremly stupid thing to do, it's also against the rules. So we won't help you when you come crying to us!\n\n\n<h2 class=\"rsc-centre-text rsc-caution-text\">7. Make sure your computer is secure!</h2>\n\nMost windows distributions are NOT secure unless you take some basic precautions:\n\nIf you use windows get the latest updates and security fixes for your computer from www.windowsupdate.com This is a MUST! Install some up to date anti-virus software. I personally use Norton-Antivirus. Alternatively you can get a free virus scanner from www.grisoft.com Install a firewall to protect your computer from external attacks. You can get free firewall software from www.zonealarm.com Be very careful about what programs you run to avoid a trojan being installed on your machine. For more information about trojans, and how to remove them see www.hackfix.org\n"},"skills":{"agility":"<h2 class=\"rsc-centre-text\">Agility guide - (members skill)</h2>\n\n*Agility is only available to RuneScape members. Please subscribe to get this feature.*\n\n<a href=\"/manual-images/rope-swing.jpg\"><img class=\"rsc-image\" src=\"/manual-images/rope-swing.jpg\" alt=\"A player about to use a rope swing\" align=\"right\" /></a>\nAgility is a skill that can be used to get over, up and through various obstacles, often as a short cut, or to get into new areas.\n\n\nTypical examples of where you use your agility skill are to squeeze through a pipe, swing on a rope over a hole, or use some handholds to climb up a wall.\n\nJust click on the obstacle you wish to get past, and if you have the appropriate agility skill level you will attempt it.\n\n<div style=\"clear:both;\"></div>\n\nYou will never fail some obstacles once you reach the appropriate agility level. On other obstacles it is possible to fall off, which will cause you to lose hitpoints.\n\nA good way to advance your agility skill is to use the obstacle courses. By going round the obstacle course in the correct order you can get an agility experience bonus from the course. This is in addition to the normal agility skill experience you get from attempting single obstacles.\n\nPlayers with low-levels of ability might want to use the obstacle course in the tree gnome stronghold.\n\n<a href=\"/manual-images/obstacle-course.jpg\"><img class=\"rsc-image\" src=\"/manual-images/obstacle-course.jpg\" alt=\"A player about to use an obstacle course\" align=\"left\" /></a>\n\nAt level 35 you can also enter the obstacle course at the barbarian outpost.\n\nAgility is a fatigue skill, which means that as you use it your character will slowly tire and eventually need to find a bed to rest on. Eating food will also reduce your character's fatigue slightly. For more information on fatigue please see our fatigue guide.\n\n<div style=\"clear:both;\"></div>\n","cooking":"<h2 class=\"rsc-centre-text\">Cooking skill</h2>\n\nThere is a variety of different foods you can cook in RuneScape. Food is useful because eating it will heal lost hit points. As you practice your cooking, your character will get better. You will burn food less often, and you will be able to make better food which heals you more.\n\nTo cook food you will need to use one of the many stoves which are scattered around the map. Alternatively if there aren't any stoves nearby you can build a campfire and use that. For more information on building fires please see our [Firemaking section](/manual/skills/firemaking).\n\nA guide to the different foods you can cook is shown below. In addition to the foods listed there are also some low-level foods and drinks which can be brought directly from the shops and pubs in RuneScape\n\n---\n\n<h3 class=\"rsc-centre-text\">Cooking Items</h3>\n\nA list of the different foods you can cook in Runescape are shown below with the cooking level needed (cooking) and the amount it heals your hit points (healing).\n\n<div class=\"rsc-skill-table rsc-cooking-table\">\n\n|Food|Level|Food|Level|\n|----|-----|----|-----|\n|Meat<br /><img src=\"/items/132.png\" alt=\"Meat\" />|Cooking 1<br />Heals 3|Bread<br /><img src=\"/items/138.png\" alt=\"Bread\" />|Cooking 1<br />Heals 4|\n|Herring<br /><img src=\"/items/362.png\" alt=\"Herring\" />|Cooking 5<br />Heals 5|Redberry pie<br /><img src=\"/items/258.png\" alt=\"Redberry pie\" />|Cooking 10<br />Heals 6|\n|Trout<br /><img src=\"/items/359.png\" alt=\"Trout\" />|Cooking 15<br />Heals 7|Pike<br /><img src=\"/items/364.png\" />|Cooking 20<br />Heals 8|\n|Meat pie<br /><img src=\"/items/259.png\" alt=\"Meat pie\" />|Cooking 20<br />Heals 8|Salmon<br /><img src=\"/items/357.png\" alt=\"Salmon\" />|Cooking 25<br />Heals 9|\n|Stew<br /><img src=\"/items/346.png\" alt=\"Stew\" />|Cooking 25<br />Heals 9|Apple pie<br /><img src=\"/items/257.png\" alt=\"Apple pie\" />|Cooking 30<br />Heals 10|\n|Tuna<br /><img src=\"/items/367.png\" alt=\"Tuna\" />|Cooking 30<br />Heals 10|Pizza<br /><img src=\"/items/325.png\" alt=\"Pizza\" />|Cooking 35<br />Heals 11|\n|Wine<br /><img src=\"/items/142.png\" alt=\"Wine\" />|Cooking 35<br />Heals 11|Lobster<br /><img src=\"/items/373.png\" alt=\"Lobster\" />|Cooking 40<br />Heals 12|\n|Cake<br /><img src=\"/items/330.png\" alt=\"Cake\" />|Cooking 40<br />Heals 12|Swordfish<br /><img src=\"/items/370.png\" alt=\"Swordfish\" />|Cooking 45<br />Heals 14|\n|Meat pizza<br /><img src=\"/items/326.png\" alt=\"Meat pizza\" />|Cooking 45<br />Heals 14|Chocolate cake<br /><img src=\"/items/332.png\" alt=\"Chocolate cake\" />|Cooking 50<br />Heals 15|\n|Anchovie pizza<br /><img src=\"/items/327.png\" alt=\"Anchovie pizza\" />|Cooking 55<br />Heals 16|Pineapple pizza<br /><img src=\"/items/750.png\" alt=\"Pineapple pizza\" />|Cooking 65<br />Heals 20|\n|Cod<br /><img src=\"/items/551.png\" alt=\"Cod\" />|Cooking 18<br />Heals 7|Bass<br /><img src=\"/items/555.png\" alt=\"Bass\" />|Cooking 43<br />Heals 13|\n|Shark<br /><img src=\"/items/546.png\" alt=\"Shark\" />|Cooking 80<br />Heals 20|Mackeral<br /><img src=\"/items/553.png\" alt=\"Mackeral\" />|Cooking 10<br />Heals 6|\n|Curry<br /><img src=\"/items/709.png\" alt=\"Curry\" />|Cooking 60<br />Heals 19|||\n\n</div>\n\n---\n\n<h3 class=\"rsc-centre-text\">How to Cook</h3>\n\n<br />\n\n<h4 class=\"rsc-centre-text\">Bread <img src=\"/items/138.png\" alt=\"Bread\" style=\"vertical-align:middle;\" /></h4>\n\n<ol class=\"rsc-centre-text\">\n<li>Pick some grain, and take it to the windmill to make flour.</li>\n<li>You will need to use a pot to pick up the flour you have made.</li>\n<li>Buy a bucket or jug, and fill it with water from a sink or fountain.</li>\n<li>Mix the flour and water to make some bread dough.</li>\n<li>Cook the dough by using it with a stove.</li>\n</ol>\n\n\n<h4 class=\"rsc-centre-text\">Pie <img src=\"/items/258.png\" alt=\"Pie\" style=\"vertical-align:middle;\" /></h4>\n\n<ol class=\"rsc-centre-text\">\n<li>Mix flour and water to make some pastry dough.</li>\n<li>Place the dough in an empty pie dish.</li>\n<li>Use your choice of filling with the empty pie. (redberry, apple or meat)</li>\n<li>Cook the pie by using it with a stove. </li>\n</ol>\n\n<h4 class=\"rsc-centre-text\">Fish <img src=\"/items/370.png\" alt=\"Swordfish\" style=\"vertical-align:middle;\" /></h4>\n\n\n<p class=\"rsc-centre-text\">\nTo cook fish you need to use your choice of fish with a fire or stove to cook it. (To find out how to catch fish please see our <a href=\"/manual/skills/fishing\">fishing section</a>)\n</p>\n\n<h4 class=\"rsc-centre-text\">Cakes <img src=\"/items/330.png\" alt=\"Cake\" style=\"vertical-align:middle;\" /></h4>\n\n<ol class=\"rsc-centre-text\">\n<li>Mix flour, eggs, milk together in a cake tin.</li>\n<li>Cook the cake by using it with a stove.</li>\n<li>Buy some chocolate and add it to the cake. (optional)</li>\n</ol>\n\n<h4 class=\"rsc-centre-text\">Stew <img src=\"/items/346.png\" alt=\"Stew\" style=\"vertical-align:middle;\" /></h4>\n\n<ol class=\"rsc-centre-text\">\n<li>Obtain a bowl, and fill it with water from a sink or fountain.</li>\n<li>Pick a potato and place it in the bowl.</li>\n<li>Cook some meat and place it in the bowl.</li>\n<li>Cook the stew by using it with a stove or fire.</li>\n</ol>\n\n<h4 class=\"rsc-centre-text\">Curry <img src=\"/items/709.png\" alt=\"Curry\" style=\"vertical-align:middle;\" /></h4>\n\n<ol class=\"rsc-centre-text\">\n<li>Make some uncooked stew(see stew description)</li>\n<li>Before cooking the stew add some spices</li>\n<li>Cook the curry by using it with a stove or fire.</li>\n</ol>\n\n<h4 class=\"rsc-centre-text\">Wine <img src=\"/items/142.png\" alt=\"Wine\" style=\"vertical-align:middle;\" /></h4>\n\n<ol class=\"rsc-centre-text\">\n<li>Fill a jug with water</li>\n<li>Use Grapes with the jug of water</li>\n</ol>\n\n<h4 class=\"rsc-centre-text\">Pizzas <img src=\"/items/325.png\" alt=\"Pizza\" style=\"vertical-align:middle;\" /></h4>\n\n<ol class=\"rsc-centre-text\">\n<li>Mix flour and water to make a pizza base.</li>\n<li>Buy a tomato and add it to the pizza.</li>\n<li>Buy some cheese and add it to the pizza.</li>\n<li>Cook the pizza by using it with a stove.</li>\n<li>Add your choice of topping to the pizza.</li>\n</ol>\n","crafting":"<h2 class=\"rsc-centre-text\">Crafting guide</h2>\nThe crafting skill can be used to make different things out of all sort of materials. Gems, gold bars, silver bars, leather and clay are all used in crafting.\n\n---\n\n<h3 class=\"rsc-centre-text\">Pottery</h3>\n<img src=\"/manual-images/crafting-pottery.png\" alt=\"Player firing pot in a pottery oven\" align=\"right\" />\n\nBowls, pots and pie dishes can all be made by crafting. Clay is obtained by mining. To make the clay workable it needs to be softened first. Use a jug of water with the clay and it will be turned into soft clay. Take the clay to a potters. There is one in the barbarian village. Use the clay on the potter's wheel and select what object you would like to make. If you have the correct crafting level you will make an unfired piece of pottery. Use it on the pottery oven and as long is doesn't crack upon heating you will have made yourself a nice new piece of pottery.\n\n<div style=\"clear:both;\"></div>\n\n<h3 class=\"rsc-centre-text\">Leather</h3>\n<img src=\"/manual-images/crafting-leather.png\" alt=\"Player firing pot in a leather oven\" align=\"left\" />\n\nLeather is made from cow hides, so you will need to find a cow field and kill some cows. Once you have a cow hide, take it to the tannery in Al Kharid. You can then craft your leather into leather armour, boots or gloves. You will need to get a needle and some thread from a crafting shop. Select the needle from your inventory and then as long as you have some thread you will be given a choice of leather objects to make.\n\n<div style=\"clear:both;\"></div>\n\n<h3 class=\"rsc-centre-text\">Gems</h3>\nGems are rare objects you will occasionally find, they can be made more valuable by cutting them. Once a gem is cut it can also be used when you are making gold jewelry. You will need to buy a chisel from a general store or a crafting shop. Select the chisel from your inventory and then the gem you wish to cut. If you find your crafting level is not high enough to cut the gem you may want to make a bit more pottery or leather to raise your crafting level first.\n\n<br />\n\n<h3 class=\"rsc-centre-text\">Holy symbols</h3>\nYou need a crafting level of 16 to craft silver bars. To make silver bars see the mining and smithing guides. You will need a holy symbol mould which can be bought from a crafting shop. Then use your silver bar on a furnace and you will be able to make a holy symbol of Saradomin.\n\n<img src=\"/manual-images/crafting-wool.png\" alt=\"Player spinning wool\" align=\"left\" />\n\nYou can either sell your holy symbol to the general store or you can make it into an object that makes your prayers last longer. If you want to use your holy symbol you will need some string. To make string, buy a pair of shears from a general store. Use the shears on a sheep to get some wool.\n\nUse the wool on a spinning wheel to spin it into a ball. Then you can use your ball of wool on your holy symbol to give it a string.\n\n<div style=\"clear:both;\"></div>\n\n<img src=\"/manual-images/crafting-symbol-bless.png\" alt=\"Player getting a holy symbol blessed from a monk\" align=\"right\" />\n\nFinally you will need to get your holy symbol blessed. This can only be done by taking it to a monk called Brother Jered. Brother Jered is upstairs in the monastery. You will need a prayer level of 31 to get in to talk to him.\n\n<div style=\"clear:both;\"></div>\n\n<h3 class=\"rsc-centre-text\">Jewelery and amulets</h3>\n<img src=\"/manual-images/crafting-jewelry.png\" alt=\"Player choosing jewlry crafting options\" align=\"left\" />\nTo make gold bars see the mining and smithing guides. You can make amulets, necklaces and rings from gold bars. Buy the appropriate moulds from a crafting shop. Use a gold bar on a furnace and select if you want to make an amulet necklace or ring. Then you will be asked if you want to put in a gem in the jewelry you are making. Putting gems in your gold jewelry can increase the smithing level required quite a lot, it also increases the value of what you are making.\n\nAll the gold jewelry can be sold for a good price, but amulets with jewels in them can also be made into useful enchanted amulets which give various bonuses. First of all your amulet will need a string, this is made in the same way as the string for the holy amulets of Saradomin. Then it can be enchanted using the [magic skil\f](/manual/skills/magic).\n\n<div style=\"clear:both;\"></div>\n\n<h3 class=\"rsc-centre-text\">Glassmaking</h3>\n\n<p class=\"rsc-centre-text\">\n<em>Glassmaking is only available to RuneScape members.</em><br />\n<em>Please subscribe to get this feature.</em>\n</p>\n\nTo make some glass, you will first need to get some seaweed. This can be obtained by big net fishing, or found on Entrana Island. Heat the seaweed, to get soda ash.\n\nThen use a bucket on a sandpit, to get a bucket of sand. With both soda ash and sand in your inventory, you can then use a furnace on either one to make molten glass.\n\nUse this molten glass with a glass-blowing pipe, which can also be found on Entrana. You will then be asked what object you would like to make.\n\n<h4 class=\"rsc-centre-text\">Glassobjects</h4>\n\n<div class=\"rsc-skill-table\">\n\n|Food|Purpose|Crafting level|\n|---|---|---|\nBeer glass<br /><img src=\"/items/620.png\" alt=\"Beer glass\" />|Fill them with beer from beer barrels|1|\nVial<br /><img src=\"/items/465.png\" alt=\"Empty vial\" />|Useful in Herblaw|33|\nOrb<br /><img src=\"/items/611.png\" alt=\"Unenchanted orb\" />|Can be enchanted andthen put on the end of battlestaffs<br />(See crafting battlestaffs)|46|\n\n</div>\n\n<h3 class=\"rsc-centre-text\">Battlestaffs</h3>\n\n<p class=\"rsc-centre-text\">\n<em>Battlestaff crafting is only available to RuneScape members.</em><br />\n<em>Please subscribe to get this feature.</em>\n</p>\n\nFirst get an unpowered orb (see glassmaking).\n\nYou will need to enchant the orb. You can make fire orbs, earth orbs, water orbs and air orbs. Take an orb to a magic obelisk (either the obelisk of air, the obelisk of earth, the obelisk of water or the obelisk of fire) and cast the appropriate orb enchantment spell on the obelisk. This requires a high magic level (see magic guide). The obelisks are not in easily accesible areas.\n\nThen buy a battlestaff from a staff shop on a members server. Use the battlestaff with a charged orb to make a battlestaff.\n\nYou will need the following crafting levels to attach the orbs to the staffs.\n\n<div class=\"rsc-skill-table\">\n\n||Battlestaff|Crafting level requirement|\n|---|---|---|\n|<img src=\"/items/616.png\" alt=\"Battlestaff of water\" />|Water|54|\n|<img src=\"/items/618.png\" alt=\"Battlestaff of earth\" />|Earth|58|\n|<img src=\"/items/615.png\" alt=\"Battlestaff of fire\" />|Fire|62|\n|<img src=\"/items/617.png\" alt=\"Battlestaff of air\" />|Air|66|\n\n</div>\n","fatigue":"<h2 class=\"rsc-centre-text\">Fatigue</h2>\n\nSome skills give you fatigue as you use them.\n\nAs your fatigue level gets higher you will not be able to use these skills as you will be too tired.\n\nThe best way to reduce your fatigue is to find a bed and to click to rest on it. This will reduce your fatigue back down to zero percent.\n\nEating food will also reduce your fatigue. Some foods reduce fatigue more than others. Foods such as Pies, pizzas and curry are among the best foods for reducing fatigue.\n","fighting":"<h2 class=\"rsc-centre-text\">Initiating combat</h2>\nTo fight a monster or character in the game just point your mouse at your opponent and select the 'attack' option. Not every character in the game can be attacked, so if no attack option is visible on the menu, then the character is probably part of some quest or shop, and is not designed to be fought.\n\n<a href=\"/manual-images/combat-hover.png\"><img class=\"rsc-image\" src=\"/manual-images/combat-hover.png\" alt=\"Hovering the mouse over a skeleton in game\" align=\"left\" /></a>\n\nWhen you point the mouse at your opponent their relative strength will be indicated next to their name. In the example here the rat can be seen to be a level-8 monster. This is also coloured coded to help you decide if you should fight or not. It your opponent is weaker than you the indicator is shown in green, for equal opponents it is shown in yellow, whereas for stronger opponents it is shown in red.\n\n<div style=\"clear:both;\"></div>\n\n<h2 class=\"rsc-centre-text\">During the fight</h2>\n<a href=\"/manual-images/combat-style.png\"><img class=\"rsc-image\" src=\"/manual-images/combat-style.png\" alt=\"Combat style interface in game\" align=\"right\" /></a>\nOnce you are fighting a monster an indicator will be displayed at the top left of the screen which you can use to select your combat style. Choosing 'accurate' will make you more likely to hit your opponent. Choosing 'aggressive' means that when you do hit your opponent you are likely to do more damage. 'Defensive' makes your opponent less likely to hit you. Whereas 'controlled' simply improves all three by a smaller amount. The combat style you select also affects which stats you gain experience points in when you kill the monster.\n\n<div style=\"clear:both;\"></div>\n\n<a href=\"/manual-images/combat-fight.png\"><img class=\"rsc-image\" src=\"/manual-images/combat-fight.png\" alt=\"A player fighting a guard in game\" align=\"left\" /></a>\nThe strength of each combat participant is indicate by a horizontal bar above their head. If your bar is entirely green you are not hurt, it will turn red as you are hit. If the bar goes entirely red your character will die. A number will also briefly appear over you whenever you are hit by your opponent, indicating how many points of damage you have just sustained.\n\nIf you find you are losing the battle, then you can run away by clicking on the ground. You can't run away during the first few seconds of combat, but after that you are free to retreat. If you do retreat it's best to keep moving until you are some distance from your opponent as they may well pursue you.\n\n<div style=\"clear:both;\"></div>\n\n<h2 class=\"rsc-centre-text\">Dying</h2>\nDying isn't much fun, so we recommend you avoid it. However most players will sooner or later get into a fight they can't win and end up losing all their hitpoints. Luckily death in RuneScape isn't permanent and after a few moments you will reappear in Lumbridge.\n\nYou keep all your stats and skills, BUT you drop the items you are carrying! It is unlikely you will be able to retrieve them so we recommend you keep as many of your valuables in the bank as possible. If you haven't attacked any other players recently (see section on player killing) you will also keep your 3 most valuable items. But you won't keep stackable items like coins, runes, arrows, etc...\n","firemaking":"<h2 class=\"rsc-centre-text\">Firemaking Guide</h2>\n<a href=\"/manual-images/fire.gif\"><img src=\"/manual-images/fire.gif\" alt=\"A burning in-game fire\" align=\"right\" /></a>\n\nMaking a fire is useful for cooking food without having to go and find a range. To make a fire drop some logs on the ground. Then use a tinderbox with the logs.\n\nYou will then attempt to light the fire.\n\nYour chance of lighting the fire depends on your firemaking level.\n\n<div style=\"clear:both;\"></div>\n","fishing":"<h2 class=\"rsc-centre-text\">Fishing guide</h2>\nFishing is a quick way of getting food to heal yourself. There are various sorts of fishing spots in the game. You will need to buy the correct fishing equipment to match the fishing spot. Fishing equipment can be bought from fishing shops.\n\n<a href=\"/manual-images/fishing-menu.png\"><img src=\"/manual-images/fishing-menu.png\" align=\"right\" alt=\"Right click menu on a fishing spot\" /></a>\nTypically a fishing spot will have a left click option and a right click option. These options are net, bait, harpoon, lure and cage.\n\nClick on the correct option and if you have the correct equipment you will attempt to catch a fish.\n\n<div style=\"clear:both;\"></div>\n\nFishing is a fatigue skill which means as you fish your character will slowly tire and eventually need to find a bed to rest on. Eating food will also reduce your character's fatigue slightly. For more information please see the [fatigue section](/manual/skills/fatigue).\n\nYou can find below the guides to each of the different types of fishing you can do in Runescape.\n\n<h2 class=\"rsc-centre-text\">Types of Fishing</h2>\n\n<h3 class=\"rsc-centre-text rsc-underline-text\">Net Fishing</h3>\n\n**Location:** found in many sea fishing locations\n\n**Required items:** Net\n\n**Fishing level requirements:** Shrimps 1, Anchovies 15\n\n<h3 class=\"rsc-centre-text rsc-underline-text\">Sea bait fishing</h3>\n\n**Location:** found in many sea fishing locations\n\n**Required items:** fishing rod, fishing bait\n\n**Fishing level requirements:** Sardine 5, Herring 10\n\n<h3 class=\"rsc-centre-text rsc-underline-text\">Fly fishing</h3>\n\n**Location:** found in many river locations\n\n**Required items:** fly fishing rod, feathers\n\n**Fishing level requirements:** Trout 20, salmon 30\n\n*(You will use up 1 feather every time you catch a fish)*\n\n<h3 class=\"rsc-centre-text rsc-underline-text\">River bait fishing</h3>\n\n**Location:** found in many river fishing locations\n\n**Required items:** fishing rod, fishing bait\n\n**Fishing level requirements:** Pike 25\n\n*(You will use up 1 bait every time you catch a fish)*\n\n<h3 class=\"rsc-centre-text rsc-underline-text\">Harpoon fishing</h3>\n\n**Location:** found in Karamja and in many sea fishing locations on the members servers.\n\n**Required items:** harpoon\n\n**Fishing level requirements:** tuna 35, swordfish 50\n\n<h3 class=\"rsc-centre-text rsc-underline-text\">Lobster fishing</h3>\n\n**Location:** found in Karamja and in many sea fishing locations on the members servers.\n\n**Required items:** lobster pot\n\n**Fishing level requirements:** Lobster 40\n\n<h3 class=\"rsc-centre-text rsc-underline-text\">Big net fishing - (members only)</h3>\n\n**Location:** found at Catherby and the fishing guild.\n\n**Required items:** Big net\n\n**Fishing level requirements:** boots 16, gloves 16, seaweed 16, Mackerel 16, Oyster shell 16, Cod 23, Bass 46\n\n<h3 class=\"rsc-centre-text rsc-underline-text\">Shark fishing - (members only)</h3>\n\n**Location:** found at Catherby and the fishing guild.\n\n**Required items:** harpoon\n\n**Fishing level requirements:** Shark 76\n","fletching":"<h2 class=\"rsc-centre-text\">Fletching guide - (members skill)</h2>\n\n*Fletching is only available to RuneScape members. Please subscribe to get this feature.*\n\n<h3 class=\"rsc-centre-text\">Making bows</h3>\n<a href=\"/manual-images/woodcutting.png\"><img class=\"rsc-image\" src=\"/manual-images/woodcutting.png\" alt=\"A player chopping an oak tree in Seers' Village with an iron axe\" align=\"right\" /></a>\n\nTo make bows you first need to acquire some wood. Depending on the type of tree you chop down you can get different sorts of logs. Next use a knife with the logs to cut them into either a shortbow or a longbow. To make a bow string you need to find a flax plant and use it with a spinning wheel. Finally add the string to the bow to complete it.\n\nRarer types of wood are harder to acquire, but make better bows which shoot more accurately. The table on the next page lists the different types of bow you can make.\n\n<div style=\"clear:both;\"></div>\n\n<h4 class=\"rsc-centre-text\">Different types of bow</h4>\n\n<div class=\"rsc-skill-table rsc-fletching-table\">\n\n|Bow type||Fletching level to make|Ranged level to wield\n|---|---|---|---|\n|Bow|<img src=\"/items/188.png\" alt=\"Regular longbow\" style=\"vertical-align:middle;\" />|Shortbow: Level 5<br />Longbow: Level 10|Any|\n|Oak bow|<img src=\"/items/648.png\" alt=\"Oak longbow\" style=\"vertical-align:middle;\" />|Shortbow: Level 20<br />Longbow: Level 25|Shortbow: Level 5<br />Longbow: Level 10|\n|Willow bow|<img src=\"/items/650.png\" alt=\"Willow longbow\" style=\"vertical-align:middle;\" />|Shortbow: Level 35<br />Longbow: Level 40|Shortbow: Level 15<br />Longbow: Level 20|\n|Maple bow|<img src=\"/items/652.png\" alt=\"Willow longbow\" style=\"vertical-align:middle;\" />|Shortbow: Level 50<br />Longbow: Level 55|Shortbow: Level 25<br />Longbow: Level 30|\n|Yew bow|<img src=\"/items/654.png\" alt=\"Yew longbow\" style=\"vertical-align:middle;\" />|Shortbow: Level 65<br />Longbow: Level 70|Shortbow: Level 35<br />Longbow: Level 40|\n|Magic bow|<img src=\"/items/656.png\" alt=\"Magic longbow\" style=\"vertical-align:middle;\" />|Shortbow: Level 80<br />Longbow: Level 85|Shortbow: Level 45<br />Longbow: Level 50|\n\n</div>\n\n<h3 class=\"rsc-centre-text\">Making arrows</h3>\nTo make an arrow-shaft just use a knife with some ordinary logs. Add a feather to the arrow shaft, and finally add an arrow-head to complete the arrow. Arrow heads can either be purchased from the member's archery shop, or smithed at an anvil. Better arrow heads will inflict more damage, but you will require a better bow to fire them. The table belows lists the different arrow types:\n\n<div class=\"rsc-skill-table rsc-fletching-table\">\n\n|Arrow type||Fletching level to make|Minimum bow required|\n|---|---|---|---|\n|Bronze arrows|<img src=\"/items/11.png\" alt=\"Bronze arrows\" style=\"vertical-align:middle;\" />|Level: 1|Any|\n|Iron arrows|<img src=\"/items/638.png\" alt=\"Iron arrows\" style=\"vertical-align:middle;\" />|Level: 15|Any|\n|Steel arrows|<img src=\"/items/640.png\" alt=\"Steel arrows\" style=\"vertical-align:middle;\" />|Level: 30|Oak bow|\n|Mithril arrows|<img src=\"/items/642.png\" alt=\"Mithril arrows\" style=\"vertical-align:middle;\" />|Level: 45|Willow bow|\n|Adamantite arrows|<img src=\"/items/644.png\" alt=\"Adamantite arrows\" style=\"vertical-align:middle;\" />|Level: 60|Maple bow|\n|Rune arrows|<img src=\"/items/646.png\" alt=\"Rune arrows\" style=\"vertical-align:middle;\" />|Level: 75|Yew bow|\n\n</div>\n","herblaw":"<h2 class=\"rsc-centre-text\">Herblaw guide</h2>\nHerblaw is used to make different sorts of potions and poisons. Before you can use herblaw you will need to complete the [druidic ritual quest](/manual/quests/druidic-ritual).\n\n<h3 class=\"rsc-centre-text\">Identifying herbs</h3>\nA lot of the herbs you find in the game will be unidentified. To be able to use them you will first need to use your herblaw skill to identify them. Just click on a herb to identify it and if you are high enough level it will then become an identified herb type. As your herblaw level gets higher you will be able to identify more and more different herbs.\n\n<h3 class=\"rsc-centre-text\">Mixing potions</h3>\n<a href=\"/manual-images/mix-potion.png\"><img class=\"rsc-image\" src=\"/manual-images/mix-potion.png\" alt=\"Inventory ingredients for mixing an attack potion\" align=\"right\" /></a>\n\nYou will need a vial. These can be bought from the herblaw shop in Taverley. Fill the vial with water from a sink or fountain. To make potions you will need a combination of one identified herb and one other ingredient as shown in the table below. You must add your herb to your vial of water first and then the other ingredient. As you reach higher levels you will be able to make more types of potions.\n\n<div style=\"clear:both;\"></div>\n\n<h3 class=\"rsc-centre-text\">Potion ingrediants</h3>\n\n<div class=\"rsc-skill-table rsc-herb-table\">\n\n|Potion type|Level|Herb needed||2nd ingredient|\n|---|---|---|---|---|\n|Attack potion|3|Guam Leaf|<img src=\"/items/270.png\" alt=\"Eye of newt\" />|Eye of Newt|\n|Cure poison potion|5|Marrentill|<img src=\"/items/473.png\" alt=\"Ground unicorn horn\" />|Ground unicorn horn|\n|Strength potion|12|Tarromin|<img src=\"/items/220.png\" alt=\"Limpwurt root\" />|Limpwurt root|\n|Stat restore potion|22|Harralander|<img src=\"/items/219.png\" alt=\"Red spider's eggs\" />|Red spider's eggs|\n|Defense potion|30|Ranarr weed|<img src=\"/items/471.png\" alt=\"White Berries\" />|White Berries|\n|Restore prayer potion|38|Ranarr weed|<img src=\"/items/469.png\" alt=\"Snape Grass\" />|Snape Grass|\n|Super attack potion|45|Irit Leaf|<img src=\"/items/270.png\" alt=\"Eye of newt\" />|Eye of newt|\n|Poison antidote|48|Irit Leaf|<img src=\"/items/473.png\" alt=\"Ground unicorn horn\" />|Ground unicorn horn|\n|Fishing potion|50|Avantoe|<img src=\"/items/469.png\" alt=\"Snape Grass\" />|Snape Grass|\n|Super strength potion|55|Kwuarm|<img src=\"/items/220.png\" alt=\"Limpwurt root\" />|Limpwurt root|\n|Weapon poison|60|Kwuarm|<img src=\"/items/472.png\" alt=\"Ground bluedragon scale \" />|Ground bluedragon scale|\n|Super defense potion|66|Cadantine|<img src=\"/items/471.png\" alt=\"White Berries\" />|White Berries|\n|Ranging potion|72|Dwarf weed|<img src=\"/items/501.png\" alt=\"Wine of Zamorak\" />|Wine of Zamorak|\n\n</div>\n\n<h3 class=\"rsc-centre-text\">Ground Ingredients</h3>\n\nThe unicorn and blue dragon scale need to be ground before they can be used in the potions. To grind them use the pestle and mortar bought from the herblaw shop.\n\n<h3 class=\"rsc-centre-text\">Weapon Poison</h3>\n<a href=\"/manual-images/poisoned.png\"><img class=\"rsc-image\" src=\"/manual-images/poisoned.png\" alt=\"A player receiving poison damage from a scorpion\" align=\"left\" /></a>\n\nThe weapon poison can only be used on arrows and on daggers. Weapon poison will only affect players and not monsters. Players can be poisoned by other player's poisoned weapons or by a poisonous npc[sic].\n\nA player will slowly take damage from the poison until it either wears off or they drink a poison antidote or cure poison potion. The poison antidote also grants a small immunity so that the drinker cannot be poisoned for a short while. The cure poison potion does not grant this immunity.\n\n<div style=\"clear:both;\"></div>\n","magic":"<h2 class=\"rsc-centre-text\">Using magic spells</h2>\n\n<a href=\"/manual-images/magic.png\"><img class=\"rsc-image\" src=\"/manual-images/magic.png\" alt=\"Magic interface in game\" align=\"right\" /></a>\nPointing at the spell book item brings up the magic menu. From here you can select spells to cast. If it's not already selected click on the 'magic' tab to show your magic spells.\n\nBelow this there is a list of all the spells available. The colour of the spell name indicates if you can cast or not. If the name appears in black your magic level is not yet high enough, and you need to practice with the lower level spells before you can cast it. If the name appears in white your player is sufficiently good at magic, but you are not holding the required runes to cast the spell. If the name appears in yellow then you have everything you need, and the spell is ready for casting.\n\n<div style=\"clear:both;\"></div>\n\nTo cast the spell just click on the spell name, and then click on your desired target in the main game window. Some spells can only be cast on hostile monsters, other spells can only be cast on yourself, so experiment to see what targets are valid for each spell.\n\n<a href=\"/manual-images/magic-hover.png\"><img class=\"rsc-image\" src=\"/manual-images/magic-hover.png\" alt=\"Hovering over a spell in the magic interface in game\" align=\"right\" /></a>\n For more information on a spell move your mouse cursor over the spell. A description of the spell and a list of which are runes are required is shown at the bottom of the window. Each required rune has 2 numbers shown above it, the 1st number indicates how many of that rune you have, and the 2nd number indicates how many you require. The numbers will be drawn in red for runes which you do not have a sufficient number of to cast the spell. Runes can be found in many places, the easiest way to obtain the low level runes is to buy them from the magic shop in Varrock. The high level runes can only be obtained by killing the correct monsters.\n\n<div style=\"clear:both;\"></div>\n\n<h2 class=\"rsc-centre-text\">Rune Types</h2>\n\nTo cast spells in the game you need the correct runes. Each of the runes has a different power, and is used for a different category of spell. Information about each of the runes is shown below:\n\n<img src=\"/items/34.png\" alt=\"Earth rune\" style=\"vertical-align:middle;\" /> Earth rune  - One of the 4 elemental runes. Can be replaced by a staff of earth.\n<img src=\"/items/33.png\" alt=\"Air rune\" style=\"vertical-align:middle;\" /> Air rune - One of the 4 elemental runes. Can be replaced by a staff of air.\n<img src=\"/items/32.png\" alt=\"Water rune\" style=\"vertical-align:middle;\" /> Water rune - One of the 4 elemental runes. Can be replaced by a staff of water.\n<img src=\"/items/31.png\" alt=\"Fire rune\" style=\"vertical-align:middle;\" /> Fire rune - One of the 4 elemental runes. Can be replaced by a staff of fire.\n<img src=\"/items/36.png\" alt=\"Body rune\" style=\"vertical-align:middle;\" /> Body rune - Required for curse spells.\n<img src=\"/items/35.png\" alt=\"Mind rune\" style=\"vertical-align:middle;\" /> Mind rune - Required for strike spells.\n<img src=\"/items/46.png\" alt=\"Cosmic rune\" style=\"vertical-align:middle;\" /> Cosmic rune - Required for amulet enchant spells.\n<img src=\"/items/41.png\" alt=\"Chaos rune\" style=\"vertical-align:middle;\" /> Chaos rune - Required for bolt spells.\n<img src=\"/items/40.png\" alt=\"Nature rune\" style=\"vertical-align:middle;\" /> Nature rune - Required for object conversion spells.\n<img src=\"/items/38.png\" alt=\"Death rune\" style=\"vertical-align:middle;\" /> Death rune - Required for blast spells.\n<img src=\"/items/42.png\" alt=\"Law rune\" style=\"vertical-align:middle;\" /> Law rune - Required for teleport spells.\n\n<h2 class=\"rsc-centre-text\">Notes about magic</h2>\n\n* After casting magic, your opponent will normally attack you. Therefore magic is a good way to start combat as it can give you a good head start.\n* Sometimes spells will fail to work. If a spell fails you keep your runes, but you can't perform magic for another 20 seconds. The higher level spells are more likely to fail, but as your magic ability improves you will have a greater chance of casting spells successfully.\n\nAlso wearing magic amulets and wielding magic staffs improves your chance of casting a spell successfully.\n","mining":"<h2 class=\"rsc-centre-text\">Mining guide</h2>\n\nThe mining skill is used to get ores and metals from rocks. The ores can then either be sold or made into different objects using the smithing and crafting skills. To mine, the only object you will need is a pickaxe. These can be bought at the axe shop in Lumbridge for 1 gold coin. Rocks can be found at the various mining sites in the RuneScape world.\n\n<a href=\"/manual-images/mining-prospect.png\"><img class=\"rsc-image\" src=\"/manual-images/mining-prospect.png\" alt=\"Hovering over the prospect option in game\" align=\"right\" /></a>\n\nIf you right click on a rock, you will get the option to prospect it. When you successfully prospect a rock, you will be told what sort of ores you are able to mine from it. Sometimes you will fail to find the ore, so you may need to try prospecting the rock several times to make sure there really is nothing there that you can mine. If your mining level is too low to mine an ore you will not be able to successfully prospect for it either.\n\n<div style=\"clear:both;\"></div>\n\n<a href=\"/manual-images/mining.png\"><img class=\"rsc-image\" src=\"/manual-images/mining.png\" alt=\"A player mining a rock\" align=\"left\" /></a>\n\nTo mine a rock select your pickaxe from your inventory then left click on the rock you wish to mine. If there is an ore in that rock there is a chance you will extract it, provided your mining is high enough to mine that particular ore. Ore is quite hard to get out of rocks - it might take quite a few attempts before you meet with success. As your mining level gets higher it will become slowly easier. Once someone has taken from a rock there will be no ore available to mine from it for a short while, wait a bit and you will be able to mine ore from it again.\n\nMining is a fatigue skill which means as you mine your character will slowly tire and eventually need to find a bed to rest on. Eating food will also reduce your character's fatigue slightly. For more information on fatigue please see our fatigue guide.\n\n<div style=\"clear:both;\"></div>\n\n<h2 class=\"rsc-centre-text\">Mining levels</h2>\n\n<div class=\"rsc-skill-table\">\n\n||Ore|Level required|\n|---|---|---|\n|<img src=\"/items/149.png\" alt=\"Clay ore\" />|Clay|1|\n|<img src=\"/items/150.png\" alt=\"Copper ore\" />|Copper Ore|1|\n|<img src=\"/items/202.png\" alt=\"Tin ore\" />|Tin Ore|1|\n|<img src=\"/items/151.png\" alt=\"Iron ore\" />|Iron Ore|15|\n|<img src=\"/items/383.png\" alt=\"Silver\" />|Silver|20|\n|<img src=\"/items/155.png\" alt=\"Coal\" />|Coal|30|\n|<img src=\"/items/152.png\" alt=\"Gold\" />|Gold|40|\n|<img src=\"/items/153.png\" alt=\"Mithril ore\" />|Mithril|55|\n|<img src=\"/items/154.png\" alt=\"Adamantite ore\" />|Adamantite|70|\n|<img src=\"/items/409.png\" alt=\"Runite ore\" />|Runite|85|\n\n</div>\n","prayer":"<h2 class=\"rsc-centre-text\">Using prayers</h2>\n\nAs well as using magic spells you can also pray to the gods of RuneScape to give you an advantage. To view the available prayers point at the spell book item at the top of the screen, and click on the 'prayers' tab to show the list.\n\n<a href=\"/manual-images/prayer-menu.png\"><img class=\"rsc-image\" src=\"/manual-images/prayer-menu.png\" align=\"right\" alt=\"Prayer list in game\" /></a>\n\nThe list of spells available is colour coded to indicate which prayers you can use. If the name appears in black your prayer level is not yet high enough. If the name appears in white the prayer is available to use.\n\nEach of the prayers can be turned on or off individually. Whilst a prayer is in use, your player will be given an advantage depending on the prayer. To activate a prayer just left click on it. The name will turn green to indicate the prayer is active. Click on the prayer again to deactivate it.\n\n<div style=\"clear:both;\"></div>\n\n<a href=\"/manual-images/prayer-altar.png\"><img class=\"rsc-image\" src=\"/manual-images/prayer-altar.png\" align=\"left\" alt=\"An altar in game\" /></a>\n\nWhilst you have prayers active your prayer-points will slowly drain down to zero. The more prayers you use at once, and the more powerful they are, the faster your points will drain. When you run out of prayer-points all the effects will be deactivated, and can't be used again until you recharge your prayer-points.\n\nTo recharge your prayer-points you must find a church in the game, and left click on the altar to recharge. You are then ready to use the different prayers again.\n\n<div style=\"clear:both;\"></div>\n\nTo use the prayers for longer, and to use the higher-level prayers in the game you need to increase your total prayer-points. You do this by burying bones from monsters you kill. Take the bones, and then left click on them in your inventory to bury them. You need to bury quite a lot of bones to advance a level, but luckily they are quite easy to come by.\n","ranging":"<h2 class=\"rsc-centre-text\">Ranging Guide</h2>\n\n<a href=\"/manual-images/ranged.gif\"><img class=\"rsc-image\" src=\"/manual-images/ranged.gif\" align=\"right\" /></a>\n\nThe ranged skill is used for attacking players or monsters from a distance with either bows and arrows or crossbows and crossbow bolts. This skill is useful if you want to help a friend fight. More than 1 person can attack an monster or player by using the ranged skill.\n\n<div style=\"clear:both;\"></div>\n\nMonsters attacked by ranged will run directly to attack you in hand to hand combat where you will not be able to use your bow. If you shoot at a monster from the other side of a fence or piece of furniture then the monster will not be able to get to you and you can keep on shooting it.\n\nA number of your arrows will land on the ground by your target so you can go and use them again, however some will be lost as they are damaged upon impact.\n\nFor further information on the selection of bows available to make and also level requirements needed to range please see our [fletching guide](/manual/skills/fletching).\n","smithing":"<h2 class=\"rsc-centre-text\">Smithing guide</h2>\n<a href=\"/manual-images/smithing-smelting.png\"/><img src=\"/manual-images/smithing-smelting.png\" alt=\"A player smelting a bronze bar\" align=\"right\" /></a>\n\nThe smithing skill is used to convert ores, obtained by [mining](/manual/skills/mining), into weapons and armours. Many players find that making equipment and selling it to shops and other players is a good way to make money.\n\nSmithing has two stages: smelting and forging. Smelting converts your ores into bars. This is done at furnaces. To convert your ore into bars select an ore in your inventory then left click on a furnace.\n\n<div style=\"clear:both;\"></div>\n\n---\n\n<h2 class=\"rsc-centre-text\">Ores/smithing levels chart</h2>\n\nYou will need different combinations of ores and different smithing levels to make each bar. Some of these requirements are shown on the next page. There are even more bars to make at higher levels.\n\n<div class=\"rsc-skill-table\">\n\n||Bar|Ores required|Level|\n|---|---|---|---|\n|<img src=\"/items/169.png\" alt=\"Bronze bar\" />|Bronze|1 Tin ore, 1 Copper ore|1|\n|<img src=\"/items/170.png\" alt=\"Iron bar\" />|Iron|1 Iron ore (50% chance of success)|15|\n|<img src=\"/items/384.png\" alt=\"Silver bar\" />|Silver|1 Silver|20|\n|<img src=\"/items/171.png\" alt=\"Steel bar\" />|Steel|2 coal, 1 Iron ore|30|\n|<img src=\"/items/172.png\" alt=\"Gold bar\" />|Gold|1 Gold|40|\n|<img src=\"/items/173.png\" alt=\"Mithril bar\" />|Mithri|4 Coal, 1 Mithril ore|50|\n|<img src=\"/items/174.png\" alt=\"Adamantite bar\" />|Adamantite|6 Coal, 1 Adamantite ore|70|\n|<img src=\"/items/408.png\" alt=\"Runite bar\" />|Runite|8 Coal, 1 Runite ore|85|\n\n</div>\n\n---\n\n<h2 class=\"rsc-centre-text\">Forging items</h2>\n\nYou will need a hammer which can be bought from any general store. To convert your bars into armour and weapons you must forge them at an anvil.\n\n<a href=\"/manual-images/smithing-forge.png\"/><img src=\"/manual-images/smithing-forge.png\" alt=\"A player using an iron bar on an anvil\" align=\"right\" /></a>\n\nSelect a bar from your inventory, then select an anvil. In the top left you will be given a series of choices to decide what sort of equipment you would like to make. You will also be shown how many bars are needed to make types of object.\n\nSelect what you would like to make and provided you have the required smithing levels and number of bars, your object will be made.\n\n<div style=\"clear:both;\"></div>\n\n<a href=\"/manual-images/smithing-menu.png\"/><img src=\"/manual-images/smithing-menu.png\" alt=\"A player deciding between swords in the smithing menu\" align=\"left\" /></a>\n\nThe smithing levels required to forge a metal type are the same as those required to smelt it. However at the levels given you will only be able to forge the most basic items in that metal (mostly daggers). A few levels off these base smithing levels you will be able to make a wider variety of things. For example at smithing level 4 you will be able to make bronze short swords.\n\nThe gold and silver bars are not used to smith weapons instead they are used in the [crafting skill](/manual/skills/crafting).\n\n<div style=\"clear:both;\"></div>\n","thieving":"<h2 class=\"rsc-centre-text\">Thieving guide - (members only)</h2>\n\n*Fletching is only available to RuneScape members. Please subscribe to get this feature.*\n\nThe thieving skill is used for a number of different activities. The main uses of the thieving skill are pickpocketing, lock picking, trap disarming and stealing from market stalls.\n\n<div class=\"rsc-row\">\n<div class=\"rsc-col rsc-col-60\" style=\"padding:0;display:flex;justify-content:center;flex-direction:column;\">\n<div>\n<h3>Pickpocketing</h3>\n<p>It is possible to steal from various npcs in the game, it is not possible to steal from other players. To start off with you can only steal from men, later on you can steal from farmers, warriors, guards and more. To pickpocket an npc right click on it and select the pickpocket option. There is a chance that the npc you are stealing from will notice and will attack you. As your thieving skill increases, you will get noticed less often.</p>\n</div>\n</div>\n<div class=\"rsc-col rsc-col-40\" style=\"padding:0;display:flex;justify-content:center;align-items:center;\">\n<img src=\"/manual-images/thieving-pickpocket.png\" alt=\"A player hovering over the pickpocket entry in the game menu\" />\n</div>\n</div>\n\n<div class=\"rsc-row\">\n<div class=\"rsc-col rsc-col-36\" style=\"padding:0;display:flex;justify-content:center;align-items:center;\">\n<div style=\"width:100%;\">\n<h3 class=\"rsc-centre-text\">Levels required to pick the pockets of various npcs</h3>\n<div class=\"rsc-skill-table\">\n\n|Character|Level required|\n|---|---|\n|Man|0|\n|Farmer|10|\n|Warrior|25|\n|Guard|40|\n|Knight|55|\n|Paladin|70|\n|Hero|80|\n\n</div>\n</div>\n</div>\n<div class=\"rsc-col rsc-col-64\" style=\"padding:0;\">\n<div>\n<h3 class=\"rsc-centre-text\">Lockpicking</h3>\n<img src=\"/manual-images/thieving-pick-lock.png\" alt=\"A player hovering over the pick lock entry in the game menu\" align=\"left\" />\n<p>Certain doors in the game can only be opened by picking their locks. To pick the lock on a door right click on it and select the picklock option.</p>\n\n<div style=\"clear:both;\"></div>\n\n<p>A low level thief will only be able to pick the locks on 1 or 2 doors, as your thieving level increases you will be a able to get into a greater variety of new areas.</p>\n</div>\n</div>\n</div>\n\n<h3 class=\"rsc-centre-text\">Trap disarming</h3>\n\nCertain objects in the game such as chests have traps on them. If you don't disarm a trap on an item, you could receive damage or other penalties when trying to use it. If there is a trap to disarm you will find an option to disarm the trap when you right click on the item. If you are a high enough thieving level you will then be able to disarm the trap. Remember traps will become re-enabled again later.\n\n<div class=\"rsc-row\">\n<div class=\"rsc-col rsc-col-50\" style=\"padding:0;display:flex;justify-content:center;flex-direction:column;\">\n<div>\n<h3>Stealing from market stalls</h3>\n<p> You can use your thieving skill to take goods from the various market stalls in Ardougne. To steal from a market stall right click on it and select the \"steal from\" option. If you are a high enough level your character will attempt to steal something from it. Certain characters will try to stop you stealing from market stalls, so wait until these npcs do not have a line of sight to you or are otherwise distracted/dead.</p>\n</div>\n</div>\n\n<div class=\"rsc-col rsc-col-50\" style=\"padding:0;display:flex;justify-content:center;align-items:center;\">\n<a href=\"/manual-images/thieving-stall.png\">/<img src=\"/manual-images/thieving-stall.png\" alt=\"A player getting caught stealing from a market stall with steal from entry being highlighted in the game menu\" /></a>\n</div>\n\n</div>\n\n<div class=\"rsc-row\">\n<div class=\"rsc-col rsc-col-60\">\n<h3 class=\"rsc-centre-text\">Thieving levels needed to be able to steal from the various market stalls.</h3>\n<div class=\"rsc-skill-table\">\n\n|Stall|Level required|\n|---|---|\n|Cake stall|5|\n|Silk stall|20|\n|Fur stall|35|\n|Silver stall|50|\n|Spices stall|65|\n|Gems stall|75|\n\n</div>\n</div>\n</div>\n","woodcutting":"<h2 class=\"rsc-centre-text\">Woodcutting Guide</h2>\n\nWoodcutting is a skill used to cut logs from trees. These logs can be used in woodcutting and firemaking.\n\nTo chop down a tree, just left click on a tree to select chop. If you have an axe in your inventory and a sufficient woodcutting level you will attempt to chop down the tree.\n\nMore powerful axes will increase your chance of cutting down the tree.\n\n<a href=\"/manual-images/woodcutting.png\"><img class=\"rsc-image\" src=\"/manual-images/woodcutting.png\" alt=\"A player chopping an oak tree in Seers' Village with an iron axe\" align=\"right\" /></a>\n\n### Woodcutting level requirements\n\n|               |          |\n| ------------- | -------- |\n| Ordinary tree | level 1  |\n| Oak tree      | level 15 |\n| Willow tre    | level 30 |\n| Maple tre     | level 45 |\n| Yew tree      | level 60 |\n| Magic tree    | level 75 |\n\n<div style=\"clear:both;\"></div>\n"}}
