{"terms":"# Terms and Conditions\n\nThis website is operated and maintained by Jagex Limited, a company registered in England and Wales (registered number 3982706), whose registered office is 11 Sturton Street, Cambridge, CB1 2SN, UK and its suppliers and partners (\"Jagex\"). Jagex and Runescape are registered trademarks of Jagex Limited in the United Kingdom, the United States and other countries.\n\nUse of this website and the services provided via it are conditional upon you accepting the following Terms and Conditions. Unless otherwise specified, your acceptance shall be indicated by your use of this website. If you do not accept these Terms and Conditions, you must not use this website.\n\n## Online games\n\n### Single Player Games\nThese require no registration or subscription to access and play.\n\n### Multiplayer Games\nThese require no subscription, but do require you to choose a Username and a Password to access and play.\n\n### RuneScape\nThere are two versions of RuneScape, a Free Version which requires no subscription but does require you to choose a Username and a Password to access and play, and a Members Version which is Subscription-based. Your use of RuneScape is also subject to our Rules of Conduct.\n\n## Your responsibilities\n\n### Username\nYou must not choose a Username that infringes the rights of any third party, impersonates Jagex staff of other users, or which is deliberately confusing or which is offensive, racist, obscene or otherwise unlawful. We reserve the right to change any Username for any reason.\n\n### Password\nYou agree to keep your Password safe at all times and not to disclose it to any other person. You must ensure that your computer is kept free of viruses and Trojans to ensure the safety of your password. Real Jagex staff will never ask you for your current password.\n\n### Subscription\nSome contents and/or services on this website are subscription-based. If you elect to purchase subscription-based content/services and transmit to us a subscription purchase request, you warrant that all the information that you submit is true and accurate (including without limitation your credit card number and expiration date, and other payment details), and you agree to pay all subscription fees you incur including all applicable taxes.\n\n### RuneScape Account\nYou agree that your RuneScape character and account and items are and remain the property of Jagex. You may not sell, transfer or lend your account to anyone else, or permit anyone else to use your account, and you may not accept an account which anybody else offers you.\n\nYou may create more than one RuneScape account, but if you do, you may not log into more than one account at any time, and they must not interact with each other in any way. Using one account to drop objects for transfer to another of your accounts is not allowed.\n\nWe reserve the right to delete all your accounts, block your access to our website and services, and/or take further legal action if you violate any of these terms and conditions. We may delete or modify any account at any time for any reason.\n\n### Sign-Up\nBy signing-up for an account you are opting-in to allow us to store personal information, cookies, etc. as described in our Privacy Policy.\n\n### Chat facility\nWhen using the chat facility you must not use any language which may be considered by others to be offensive, racist or obscene, or otherwise infringes the rights of third parties. You must not use the chat facility to harass, threaten, scam or deceive other players. You agree that the chat facility is only for role-playing in the game, and is not designed or intended to be used as a forum for other types of discussion. You must not use the chat facility to advertise other websites or products.\n\nYou agree that for the purpose of preventing offensive language and cheating we may automatically or manually censor the chat as we see fit, and that we may record or monitor the chat to help us identify offenders. Sexually harassing, threatening, stalking or otherwise harassing others may result in legal action being taken against you.\n\nIf you are the victim of the sort of behaviour described above, or receive any other unwanted communications you must use the built in facilities to block the messages. If there is a particular user causing a problem then use the ignore function to block further messages (to do this point at the friends menu, click on the 'ignore' tab, click where it says 'click here to add a name' and enter the name of the user to block). If you continue to receive unwanted messages, or receive harassment from multiple players you must use the privacy controls to block all messages from everyone except your friends (to do this point at the configuration menu, and ensure all four privacy settings are switched to 'on'). If you continue to suffer problems, or are not satisfied then you must stop using this web site.\n\n### Cheating\nYou must not exploit any cheats or errors which you find in the Multiplayer Games or RuneScape. Any cheats or errors which you discover must be reported immediately to us.\n\nYou must not attempt to use other programs in conjunction with the Multiplayer Games or RuneScape to give yourself an unfair advantage. You may not use any bots or macros to control your character for you. When you are not playing a Game you must logout. You may not circumvent any of our mechanisms designed to logout inactive users automatically.\n\nYou must not misuse any of our customer service facilities. You must not deliberately enter false information into any of the forms on our website, or in our games. You must not encourage, or attempt to trick other players into breaking our rules.\n\n### Provision of service\nYou must not reverse-engineer, decompile or modify the RuneScape client in any way. You must not use a modified/customised version of the RuneScape client. You must not create or provide any other means by which any of the Games provided by this web site may be played by others (including, without limitation, replacement or modified client/server software, server emulators).\n","about":{"getting-started":"<h2 class=\"rsc-centre-text\">How do I get started?</h2>\nGetting started in RuneScape is an easy and quick process. You can literally be playing within a few minutes.\n\n---\n\n<h3 class=\"rsc-centre-text\">Creating an Account</h3>\n\nFirst of all you must create your account.\n\nThis can be done by clicking the \"play game\" link from the RuneScape main page. This will take you to a screen which gives you the option to play the free game or the member's game.\n\n<img class=\"rsc-image\" src=\"/manual-images/free-game.jpg\" align=\"right\" />\nYou will need to select the free game option for now, but as soon as the registration process is over you may create a members account by going to our [members sign up area](#TODO)\n\n<div style=\"clear:both;\"></div>\n\n---\n\nThis will take you to our world select screen.\n\n<img class=\"rsc-image\" src=\"/manual-images/world-select.jpg\" align=\"right\" />\nAll of the worlds are identical in terms of content, the only difference being the players playing on each one. Select one of the worlds by clicking one of the green links.\n\n<div style=\"clear:both;\"></div>\n\n(Any one will do, although some people find choosing a world with a location nearest to them gives them the best game playing speed)\n\nThe initial download process will then start. During the download a grey security box will pop up. You will be asked 'Do you want to install and run Runescape?' You should check the box that appears next to 'Always trust content from Jagex Ltd' and click OK.\n\n---\n\nWhen the game has loaded you will be presented with a login screen. You will need to choose the option of \"New User\" and then decide on a username and password for your account. You should then tick the box that agrees to our terms of service and click the submit button.\n\n<img class=\"rsc-image\" src=\"/manual-images/design-character.jpg\" align=\"right\" />\n\nYou will then be presented with a character design page\n\nYou should use the right and left arrows to toggle each option until you are happy with your characters look.\n\nYou can change all of the physical appearances of your character as viewed from the screenshot to the right. There is an option in game for you to change your appearance again, though beware it will cost you RuneScape currency for such a privaledge so make sure your character design choices are ones you like!\n\nOnce you have finished you should click the submit button which will launch your character into our tutorial Island!\n\n<div style=\"clear:both;\"></div>\n\n---\n\nTutorial Island is the first place your character will enter in RuneScape. Here you will be introduced to the basics of RuneScape and also participate in some of the skills and trades available. You will be taken through a variety of skills by each instructor which will include casting spells, fishing, mining, combat and much more!\n\n<img class=\"rsc-image\" src=\"/manual-images/tutorial-island.jpg\" align=\"right\" />\nThis should only take about 15 minutes to complete and you will then catch the boat to Lumbridge town where your RuneScape adventure will truly begin!\n\nFrom there you will be able to interact with all of our players, and design your own journey in Runescape!\n\n<div style=\"clear:both;\"></div>\n\n---\n\n<h3 class=\"rsc-centre-text\">Further References</h3>\n(All accessible from main page)\n\n<a class=\"rsc-centre-text\" href=\"/manual\"><h4>RuneScape Manual</h4></a>\nHere you can find information on game controls, skills, quests, rules of conduct and many helpful guides. We suggest you take the time to read this as it contains a wealth of information that will enable you to play RuneScape to its fullest potential.\n\n<a class=\"rsc-centre-text\" href=\"/news\"><h4>News and Updates</h4></a>\nHere you can keep up to date with the development of RuneScape including news on game updates, customer support issues, behind the scenes info, community news and much more.\n\nIt's worth checking this on a regular basis as we update on a weekly basis\n\n[Go to the Rune Scape website to find out more.](/)\n","what-is-a-virtual-world":"<h2 class=\"rsc-centre-text\">What is a virtual world?</h2>\n\nA virtual world is a place where thousands of people from across the globe can interact with each other at the press of a button. Not only will you meet players of all ages and backgrounds, but your actions will have a real impact on shaping the environment and the development of RuneScape.\n\nWhatever the time you log in there will be thousands of online players in our community to interact with. Combine that with over a 1000 different objects to find/trade and a large landscape to explore, you will always have something exciting to attend to.\n\nYou have the absolute freedom and opportunity to create your own virtual life. So why not [get started](/manual/about/getting-started)?\n","what-is-runescape":"<h2 class=\"rsc-centre-text\">What is RuneScape?</h2>\n\nRunescape is a massive multiplayer adventure, with monsters to kill, quests to complete, and treasure to win. You control your own character who will improve and become more powerful the more you play. This isn't a game where everything that happens is pre-determined. What you do in the world is up to you!\n\nRuneScape isn't a game you can just finish in a week, and we are adding in more features and quests on a regular basis to ensure there is always something new for you to try!\n\nSo, read on and most importantly, have fun!\n\nAndrew Gower (Head of Development)\n\n---\n\n<h3 class=\"rsc-centre-text\">Game Features</h3>\n\n<h4 class=\"rsc-centre-text\">Skills</h4>\n\nThere are plenty of skills within RuneScape that you can work at. You could train your character to be an all rounder or you can specialize and perhaps earn a living practicing a craft such as cooking or crafting. The choice is yours and with the large selection of skills available you will definately be spoilt for choice. You can find more information on our skills [here](/manual/skills).\n\n<h4 class=\"rsc-centre-text\">Quests</h4>\n\nMany of the characters in the game can give you quests to go on, each with different rewards. If you are brave you can search for riches in the dungeons or sewers but make sure you are well armed! Try your hand at archery, or learn some magic spells to give yourself an extra advantage. More information on our quests can be found [here](/manual/quests).\n\n<h4 class=\"rsc-centre-text\">Global community</h4>\n\nThe game is multiplayer which means you will meet many other people in the world who you can communicate and trade with. Make new friends and go adventuring together to stand a better chance against the stronger monsters. Perhaps you want to make your money trading valuable goods with others. Or if you like taking risks, you can choose to fight with like-minded people to try and steal their treasure.\n\n(Please see our [safety guide](/manual/guides/safety) so you can be both safe and have fun.)\n\n---\n\n<h3 class=\"rsc-centre-text\">RuneScape Ingredients</h3>\n\n* Over 730,000 map tiles make up the huge world\n* Over 1080 frames of animation for the monsters and players\n* Over 1000 different objects to find and trade\n* Over 22,000 items of scenery with over 950 different designs\n* Over 3200 characters all walking around the map, with over 700 different designs\n"}}
